# 2024-9-3 13:46:5

zhR = {
('жалоба/осмотр: анальный зуд', 'анальный зуд'), 
('жалоба/осмотр: аномалия развития лицевого черепа', 'аномалия развития лицевого черепа'), 
('жалоба/осмотр: атаксия', 'не скоординированые движения'), 
('жалоба/осмотр: атаксия', 'нарушение согласованности движений различных мышц при условии отсутствия мышечной слабости'), 
('жалоба/осмотр: атаксия', 'неуклюжие движения'), 
('жалоба/осмотр: атаксия', 'атаксия'), 
('жалоба/осмотр: атаксия', 'нарушение согласованности движений и моторики'), 
('жалоба/осмотр: атаксия', 'неуклюжие не скоординированые движения, часто нарушается равновесие'), 
('жалоба/осмотр: атрофические изменения слизистой оболочки желудочно-кишечного тракта', 'атрофические изменения слизистой оболочки желудочно-кишечного тракта'), 
('жалоба/осмотр: атрофия мышц', 'атрофия мышц'), 
('жалоба/осмотр: атрофия сосочков языка', 'атрофия сосочков языка'), 
('жалоба/осмотр: атрофия сосочков языка', 'атрофический глоссит'), 
('жалоба/осмотр: атрофия сосочков языка', 'полированный язык'), 
('жалоба/осмотр: атрофия сосочков языка', 'хантеровский глоссит'), 
('жалоба/осмотр: атрофия сосочков языка', 'atrophic glossitis'), 
('жалоба/осмотр: атрофия сосочков языка', 'moeller glossitis'), 
('жалоба/осмотр: атрофия сосочков языка', 'лакированный язык'), 
('жалоба/осмотр: атрофия сосочков языка', 'moeller-hunter glossitis'), 
('жалоба/осмотр: атрофия сосочков языка', 'атрофичный язык'), 
('жалоба/осмотр: атрофия сосочков языка', 'сглаженность сосочков языка'), 
('жалоба/осмотр: атрофия сосочков языка', 'гунтеровский глоссит'), 
('жалоба/осмотр: атрофия сосочков языка', 'hunter glossitis'), 
('жалоба/осмотр: атрофия сосочков языка', 'atrophy of tongue papillae'), 
('жалоба/осмотр: ахоличный кал', 'белый кал'), 
('жалоба/осмотр: ахоличный кал', 'обесцвеченный кал'), 
('жалоба/осмотр: ахоличный кал', 'обесцвечивание кала'), 
('жалоба/осмотр: ахоличный кал', 'ахоличный кал'), 
('жалоба/осмотр: белый густой налет на языке', 'белый густой налет на языке'), 
('жалоба/осмотр: белый густой налет на языке', 'язык обложен густым белым налетом'), 
('жалоба/осмотр: беспокойное поведение', 'беспокойное поведение'), 
('жалоба/осмотр: беспокойное поведение', 'ажитация'), 
('жалоба/осмотр: бессонница', 'бессонница'), 
('жалоба/осмотр: бледность', 'бледность'), 
('жалоба/осмотр: бледность', 'бледный оттенок кожных покровов и слизистых'), 
('жалоба/осмотр: бледность кожи', 'бледность кожи'), 
('жалоба/осмотр: бледность кожи', 'бледность кожных покровов'), 
('жалоба/осмотр: бледность слизистых оболочек', 'бледность слизистых оболочек'), 
('жалоба/осмотр: вогнутость на поверхности ногтя', 'койлонихии'), 
('жалоба/осмотр: вогнутость на поверхности ногтя', 'койлонихия'), 
('жалоба/осмотр: вогнутость на поверхности ногтя', 'ложкообразная вогнутость ногтя'), 
('жалоба/осмотр: вогнутость на поверхности ногтя', 'блюдцеобразная вогнутость ногтя'), 
('жалоба/осмотр: вогнутость на поверхности ногтя', 'вдавление на поверхности ногтя'), 
('жалоба/осмотр: вогнутость на поверхности ногтя', 'вогнутость на поверхности ногтя'), 
('жалоба/осмотр: выпадение волос', 'выпадение волос'), 
('жалоба/осмотр: высыпания на коже', 'высыпания на коже'), 
('жалоба/осмотр: вязкий кал', 'вязкий кал'), 
('жалоба/осмотр: грязно-серый оттенок кожных покровов', 'грязно-серый оттенок кожных покровов'), 
('жалоба/осмотр: деменция', 'старческое слабоумие'), 
('жалоба/осмотр: деменция', 'старческий маразм'), 
('жалоба/осмотр: деменция', 'деградация памяти, мышления, поведения и способности выполнять ежедневные действия'), 
('жалоба/осмотр: деменция', 'деградация памяти, мышления, поведения'), 
('жалоба/осмотр: деменция', 'деменция'), 
('жалоба/осмотр: деменция', 'старческий склероз'), 
('жалоба/осмотр: деменция', 'приобретенное слабоумие'), 
('жалоба/осмотр: депрессия', 'депрессия'), 
('жалоба/осмотр: деформация ногтевых пластин', 'деформация ногтевых пластин'), 
('жалоба/осмотр: диарея', 'поносы'), 
('жалоба/осмотр: диарея', 'диарея'), 
('жалоба/осмотр: диарея', 'жидкий стул'), 
('жалоба/осмотр: диарея', 'диареи'), 
('жалоба/осмотр: диарея', 'понос'), 
('жалоба/осмотр: динамическая атаксия', 'динамическая атаксия'), 
('жалоба/осмотр: динамическая атаксия', 'нарушение координации при движении'), 
('жалоба/осмотр: желтушность', 'желтоватость кожи'), 
('жалоба/осмотр: желтушность', 'желтушность слизистых оболочек'), 
('жалоба/осмотр: желтушность', 'небольшая желтушность'), 
('жалоба/осмотр: желтушность', 'желтуха'), 
('жалоба/осмотр: желтушность', 'желтоватость слизистых оболочек'), 
('жалоба/осмотр: желтушность', 'желтушность кожи'), 
('жалоба/осмотр: желтушность', 'субиктеричность кожи'), 
('жалоба/осмотр: желтушность', 'желтушность'), 
('жалоба/осмотр: желтушность', 'иктеричность склер'), 
('жалоба/осмотр: желтушность', 'иктеричность'), 
('жалоба/осмотр: желтушность', 'желтушная окраска'), 
('жалоба/осмотр: желтушность', 'желтоватость'), 
('жалоба/осмотр: желтушность', 'субиктеричность'), 
('жалоба/осмотр: желтушность', 'желтоватость склер'), 
('жалоба/осмотр: желтушность', 'желтушность склер'), 
('жалоба/осмотр: желтые испражнения с незначительной примесью слизи', 'желтые испражнения с незначительной примесью слизи'), 
('жалоба/осмотр: желтые испражнения с незначительной примесью слизи', 'желтый кал с незначительной примесью слизи'), 
('жалоба/осмотр: желтые испражнения с незначительной примесью слизи', 'желтый стул с незначительной примесью слизи'), 
('жалоба/осмотр: задержка мочи', 'задержка мочи'), 
('жалоба/осмотр: изменение голоса', 'изменения голоса'), 
('жалоба/осмотр: изменение голоса', 'изменение голоса'), 
('жалоба/осмотр: изменение запаха кала', 'изменение запаха кала'), 
('жалоба/осмотр: изменение консистенции кала', 'изменение консистенции кала'), 
('жалоба/осмотр: изменение цвета кала', 'изменение цвета кала'), 
('жалоба/осмотр: икота', 'икота'), 
('жалоба/осмотр: истончение ногтей', 'истончение ногтей'), 
('жалоба/осмотр: истощение', 'истощение'), 
('жалоба/осмотр: кариес', 'развитие кариеса'), 
('жалоба/осмотр: кариес', 'кариес'), 
('жалоба/осмотр: кашель', 'кашель'), 
('жалоба/осмотр: кашель с кровью', 'кашель с кровью'), 
('жалоба/осмотр: кашицеобразный кал', 'кашицеобразный кал'), 
('жалоба/осмотр: кончики ногтей изогнуты вниз больше обычного', 'кончики ногтей изогнуты вниз больше обычного'), 
('жалоба/осмотр: кончики ногтей изогнуты вниз больше обычного', 'кончики ногтей начинают изгибаться вниз больше обычного'), 
('жалоба/осмотр: крапивница', 'хроническая крапивница'), 
('жалоба/осмотр: крапивница', 'крапивница'), 
('жалоба/осмотр: крапивница', 'крапивная лихорадка'), 
('жалоба/осмотр: крапивница', 'уртикария'), 
('жалоба/осмотр: крапивница', 'крапивная сыпь'), 
('жалоба/осмотр: крапивница', 'urticaria'), 
('жалоба/осмотр: куриная слепота', 'ухудшение ночного зрения'), 
('жалоба/осмотр: куриная слепота', 'куриная (ночная) слепота'), 
('жалоба/осмотр: куриная слепота', 'ухудшение сумеречного зрения'), 
('жалоба/осмотр: куриная слепота', 'гемералопия'), 
('жалоба/осмотр: куриная слепота', 'куриная слепота'), 
('жалоба/осмотр: куриная слепота', 'ночная слепота'), 
('жалоба/осмотр: ломкость волос', 'ломкость волос'), 
('жалоба/осмотр: ломкость ногтей', 'ломкость ногтей'), 
('жалоба/осмотр: метеоризм', 'метеоризм'), 
('жалоба/осмотр: метеоризм', 'избыточное газообразование'), 
('жалоба/осмотр: метеоризм', 'вздутие живота'), 
('жалоба/осмотр: метеоризм', 'вздутие'), 
('жалоба/осмотр: метеоризм', 'вспучивание живота'), 
('жалоба/осмотр: мышечные спазмы', 'мышечный спазм'), 
('жалоба/осмотр: мышечные спазмы', 'мышечные спазмы'), 
('жалоба/осмотр: налет на языке', 'налет на языке'), 
('жалоба/осмотр: налет на языке', 'обложенность налетом языка'), 
('жалоба/осмотр: наличие в кале непереваренной пищи', 'наличие в кале непереваренной пищи'), 
('жалоба/осмотр: нарушение глотания', 'нарушение глотания'), 
('жалоба/осмотр: нарушение глотания', 'застревание пищи в горле'), 
('жалоба/осмотр: нарушение глотания', 'застревание пищи в глотке'), 
('жалоба/осмотр: нарушение глотания', 'дисфагия'), 
('жалоба/осмотр: нарушение глотания', 'нарушение акта глотания'), 
('жалоба/осмотр: нарушение зрения', 'нарушение зрения'), 
('жалоба/осмотр: нарушение зрения', 'нарушения зрения'), 
('жалоба/осмотр: нарушение координации движений', 'нарушение координации движений'), 
('жалоба/осмотр: нарушение осанки', 'нарушение осанки'), 
('жалоба/осмотр: нарушение сна', 'плохой сон'), 
('жалоба/осмотр: нарушение сна', 'нарушение сна'), 
('жалоба/осмотр: нарушения слуха', 'нарушения слуха'), 
('жалоба/осмотр: невозможность удержать мочу при смехе, кашле, чихании', 'невозможность удержать мочу при смехе, кашле, чихании'), 
('жалоба/осмотр: недержание мочи', 'недержание мочи'), 
('жалоба/осмотр: недержание мочи', 'инконтиненция'), 
('жалоба/осмотр: недержание мочи', 'слабость сфинктеров мочевого пузыря'), 
('жалоба/осмотр: недержание мочи', 'неудержание мочи'), 
('жалоба/осмотр: неустойчивый стул', 'неустойчивый стул'), 
('жалоба/осмотр: нистагм', 'дрожание глаз'), 
('жалоба/осмотр: нистагм', 'колебание глаз'), 
('жалоба/осмотр: нистагм', 'нистагм'), 
('жалоба/осмотр: нистагм', 'тремор глаз'), 
('жалоба/осмотр: нистагм', 'бегание глаз'), 
('жалоба/осмотр: обморок', 'синкопе'), 
('жалоба/осмотр: обморок', 'обморок'), 
('жалоба/осмотр: образование на коже трещин', 'образование на коже трещин'), 
('жалоба/осмотр: обратимые нарушения зрения', 'обратимые нарушения зрения'), 
('жалоба/осмотр: обширные отеки', 'обширные отеки'), 
('жалоба/осмотр: обширные отеки', 'генерализованные отеки'), 
('жалоба/осмотр: обширные травмы', 'обширные травмы'), 
('жалоба/осмотр: одышка', 'одышка'), 
('жалоба/осмотр: ожог', 'ожог'), 
('жалоба/осмотр: ожог', 'ожоги'), 
('жалоба/осмотр: опущенное веко', 'опущение века'), 
('жалоба/осмотр: опущенное веко', 'опущенное веко'), 
('жалоба/осмотр: осиплость голоса', 'осиплость голоса'), 
('жалоба/осмотр: отрыжка', 'отрыжка воздухом или пищей'), 
('жалоба/осмотр: отрыжка', 'отрыжка'), 
('жалоба/осмотр: пенистость мочи', 'пенистость мочи'), 
('жалоба/осмотр: поза зародыша', 'поза зародыша'), 
('жалоба/осмотр: поза зародыша', 'вынужденное положение поза зародыша'), 
('жалоба/осмотр: поза зародыша', 'вынужденное положение тела поза зародыша'), 
('жалоба/осмотр: покраснение кончика языка', 'покраснение кончика языка'), 
('жалоба/осмотр: покраснение лица', 'покраснение лица'), 
('жалоба/осмотр: покраснение языка', 'эритема языка'), 
('жалоба/осмотр: покраснение языка', 'покраснение языка'), 
('жалоба/осмотр: покраснение языка', 'гиперемия языка'), 
('жалоба/осмотр: полиурия', 'полиурия'), 
('жалоба/осмотр: полиурия', 'выделение мочи в объеме более 3 л в день'), 
('жалоба/осмотр: полифекалия', 'полифекалия'), 
('жалоба/осмотр: поперечная исчерченность ногтей', 'поперечная исчерченность ногтей'), 
('жалоба/осмотр: постоянное покашливание', 'постоянное покашливание'), 
('жалоба/осмотр: потемнение мочи', 'потемнение мочи'), 
('жалоба/осмотр: потеря веса', 'снижение веса'), 
('жалоба/осмотр: потеря веса', 'похудение'), 
('жалоба/осмотр: потеря веса', 'похудание'), 
('жалоба/осмотр: потеря веса', 'снижение массы тела'), 
('жалоба/осмотр: потеря веса', 'потеря веса'), 
('жалоба/осмотр: потливость', 'потливость'), 
('жалоба/осмотр: потливость', 'повышенная потливость'), 
('жалоба/осмотр: потливость', 'повышенное потоотделение'), 
('жалоба/осмотр: приступы кашля и/или удушья преимущественно в ночное время, после обильной еды', 'приступы кашля и/или удушья преимущественно в ночное время, после обильной еды'), 
('жалоба/осмотр: психоз', 'психоз'), 
('жалоба/осмотр: раннее поседение волос', 'раннее поседение волос'), 
('жалоба/осмотр: расчесы на коже', 'расчесы на коже'), 
('жалоба/осмотр: рвота', 'рвота'), 
('жалоба/осмотр: рвота с кровью', 'рвота с кровью'), 
('жалоба/осмотр: рвота, не приносящая облегчения, вначале пищей, затем содержимым с примесью желчи, сопровождается тошнотой', 'рвота, не приносящая облегчения, вначале пищей, затем содержимым с примесью желчи, сопровождается тошнотой'), 
('жалоба/осмотр: редкий сухой кашель', 'редкий сухой кашель'), 
('жалоба/осмотр: редкий сухой кашель', 'редкий сухой кашель или с небольшим количеством трудноотделяемой мокроты, может быть мучительным, приступообразным'), 
('жалоба/осмотр: серый цвет кала', 'серый цвет кала'), 
('жалоба/осмотр: симптом "красных капелек"', 'четко отграниченные ярко-красные пятна на коже живота, груди, иногда в области спины'), 
('жалоба/осмотр: симптом "красных капелек"', 'симптом "красных капелек"'), 
('жалоба/осмотр: симптом "синих склер"', 'синеватость или голубизна склер'), 
('жалоба/осмотр: симптом "синих склер"', 'синеватость склер'), 
('жалоба/осмотр: симптом "синих склер"', 'симптом "синих склер"'), 
('жалоба/осмотр: симптом "синих склер"', 'голубизна склер'), 
('жалоба/осмотр: симптом Айзенберга I', 'удар ребром ладони ниже угла правой лопатки вызывает умеренную и "пронизывающую" локальную боль в области желчного пузыря'), 
('жалоба/осмотр: симптом Айзенберга I', 'симптом Айзенберга I'), 
('жалоба/осмотр: симптом Айзенберга I', 'удар ребром ладони ниже угла правой лопатки вызывает умеренную локальную боль и "пронизывающую" - в области желчного пузыря'), 
('жалоба/осмотр: симптом Алиева', 'появление наряду с локальной болезненностью при пальпации в точках Боаса или Маккензи иррадирующей боли по направлению к желчному пузырю'), 
('жалоба/осмотр: симптом Алиева', 'симптом Алиева'), 
('жалоба/осмотр: симптом Гротта', 'симптом Гротта'), 
('жалоба/осмотр: симптом Гротта', 'атрофия подкожно-жировой клетчатки в зоне, соответствующей проекции поджелудочной железы на переднюю брюшную стенку'), 
('жалоба/осмотр: симптом Кера', 'боль в правом подреберье во время глубокого вдоха'), 
('жалоба/осмотр: симптом Кера', 'симптом Кера'), 
('жалоба/осмотр: симптом Мерфи', 'симптом Мерфи'), 
('жалоба/осмотр: симптом Мерфи', 'боль при пальпации в правом подреберье на вдохе'), 
('жалоба/осмотр: симптом Щеткина-Блюмберга', 'симптом Щеткина-Блюмберга'), 
('жалоба/осмотр: симптом Щеткина-Блюмберга', 'резкое усилениеболи в животепри быстром снятиипальпирующейруки с передней брюшной стенки после надавливания'), 
('жалоба/осмотр: симптомы поражения черепных нервов', 'поражение черепных нервов'), 
('жалоба/осмотр: симптомы поражения черепных нервов', 'симптомы поражения черепных нервов'), 
('жалоба/осмотр: снижение объема рабочей памяти', 'снижение объема рабочей памяти'), 
('жалоба/осмотр: снижение скорости мышления', 'снижение скорости мышления'), 
('жалоба/осмотр: снижение скорости мышления', 'уменьшение умственной функции'), 
('жалоба/осмотр: снижение скорости реакции на неожиданные ситуации', 'снижение скорости реакции на неожиданные ситуации'), 
('жалоба/осмотр: снижение способности к концентрации внимания', 'снижение способности к концентрации внимания'), 
('жалоба/осмотр: снижение способности контролировать импульсивное поведение', 'снижение способности контролировать импульсивное поведение'), 
('жалоба/осмотр: снижение тургора кожи', 'снижение тургора кожи'), 
('жалоба/осмотр: статическая атаксия', 'нарушение равновесия при стоянии'), 
('жалоба/осмотр: статическая атаксия', 'статическая атаксия'), 
('жалоба/осмотр: стеаторея', 'наличие избыточного жира в кале'), 
('жалоба/осмотр: стеаторея', 'стеаторея'), 
('жалоба/осмотр: стеаторея', 'сальный вид кала'), 
('жалоба/осмотр: судороги', 'судороги'), 
('жалоба/осмотр: сухость глаз', 'сухость глаз'), 
('жалоба/осмотр: сухость глаз', 'сухость роговицы и конъюнктивы глаза'), 
('жалоба/осмотр: сухость глаз', 'синдром сухого глаза'), 
('жалоба/осмотр: сухость глаз', 'ксерофтальмия'), 
('жалоба/осмотр: сухость кожи', 'ксеродермия'), 
('жалоба/осмотр: сухость кожи', 'ксероз'), 
('жалоба/осмотр: сухость кожи', 'снижение влажности кожи'), 
('жалоба/осмотр: сухость кожи', 'сухая кожа'), 
('жалоба/осмотр: сухость кожи', 'ксероз кожи'), 
('жалоба/осмотр: сухость кожи', 'сухость кожи'), 
('жалоба/осмотр: сухость языка', 'сухость языка'), 
('жалоба/осмотр: сыпь', 'кожная сыпь'), 
('жалоба/осмотр: сыпь', 'сыпь'), 
('жалоба/осмотр: тошнота', 'тошнота'), 
('жалоба/осмотр: травма уха', 'травма уха'), 
('жалоба/осмотр: травма уха', 'травмы уха'), 
('жалоба/осмотр: трещины в углу рта', 'трещины, заеды в углах рта'), 
('жалоба/осмотр: трещины в углу рта', 'ангулярный стоматит'), 
('жалоба/осмотр: трещины в углу рта', 'трещины в уголках рта'), 
('жалоба/осмотр: трещины в углу рта', 'трещины в углах рта'), 
('жалоба/осмотр: трещины в углу рта', 'трещины в углу рта'), 
('жалоба/осмотр: трещины в углу рта', 'заеды в углах рта'), 
('жалоба/осмотр: тусклость волос', 'тусклость волос'), 
('жалоба/осмотр: тусклость ногтей', 'тусклость ногтей'), 
('жалоба/осмотр: увеличение лимфатических узлов', 'увеличение лимфатических узлов'), 
('жалоба/осмотр: увеличение миндалин', 'увеличение миндалин'), 
('жалоба/осмотр: увеличение миндалин', 'отек миндалин'), 
('жалоба/осмотр: увеличение миндалин', 'отечность миндалин'), 
('жалоба/осмотр: урчание живота', 'урчание живота'), 
('жалоба/осмотр: урчание живота', 'урчание'), 
('жалоба/осмотр: участки пигментации на лице и конечностях', 'участки пигментации на лице и конечностях'), 
('жалоба/осмотр: частое мочеиспускание', 'частое мочеиспускание'), 
('жалоба/осмотр: черный стул', 'черный стул'), 
('жалоба/осмотр: черный стул', 'мелена'), 
('жалоба/осмотр: чихание', 'чихание'), 
('жалоба/осмотр: шелушение кожи', 'шелушение кожи'), 
('жалоба/осмотр: экхимозы', 'синяки'), 
('жалоба/осмотр: экхимозы', 'экхимозы'), 
('жалоба/осмотр: экхимозы', 'кровоизлияния в кожу или слизистую оболочку'), 
('жалоба/осмотр: экхимозы', 'синяк'), 
('жалоба/осмотр: энурез', 'энурез'), 
('жалоба/осмотр: энурез', 'ночное недержание мочи'), 
('жалоба/осмотр: эрозия эмали зубов', 'эрозия эмали зубов'), 
('жалоба/пальпация: боль при пальпации живота в эпигастральной области', 'боль при пальпации живота в верхней части'), 
('жалоба/пальпация: боль при пальпации живота в эпигастральной области', 'боль при пальпации живота в эпигастральной области'), 
('жалоба/пальпация: боль при пальпации живота в эпигастральной области', 'боль при пальпации живота в верхней области'), 
('жалоба/пальпация: боль при пальпации живота в эпигастральной области', 'болезненность при пальпации живота в эпигастральной области'), 
('жалоба/пальпация: боль при пальпации живота в эпигастральной области', 'умеренная болезненность в эпигастральной области при пальпации'), 
('жалоба/пальпация: боль при пальпации живота в эпигастральной области', 'при пальпации живота умеренная болезненность в эпигастральной области'), 
('жалоба/пальпация: боль при пальпация живота с иррадиацией в спину, позвоночник, левое подреберье, надплечье', 'боль при пальпация живота с иррадиацией в спину, позвоночник, левое подреберье, надплечье'), 
('жалоба/пальпация: пальпаторно болезненность в правом подреберье', 'боль в правом подреберье при пальпации'), 
('жалоба/пальпация: пальпаторно болезненность в правом подреберье', 'пальпаторно болезненность в правом подреберье'), 
('жалоба/пальпация: снижение тургора кожи', 'снижение тургора кожи'), 
('жалоба/пальпация: умеренная болезненность в пилоро-дуоденальной области при пальпации', 'умеренная болезненность в пилоро-дуоденальной области при пальпации'), 
('жалоба: болезненность в левом реберно-позвоночном углу', 'болезненность в зоне Мэйо-Робсона'), 
('жалоба: болезненность в левом реберно-позвоночном углу', 'болезненность в левом реберно-позвоночном углу (зона Мэйо-Робсона)'), 
('жалоба: болезненность в левом реберно-позвоночном углу', 'болезненность в левом реберно-позвоночном углу'), 
('жалоба: болезненность языка', 'болезненность языка'), 
('жалоба: боль', 'боль'), 
('жалоба: боль', 'dolor'), 
('жалоба: боль', 'алгия'), 
('жалоба: боль в горле', 'боль в горле'), 
('жалоба: боль в горле при глотании', 'боль в горле при глотании'), 
('жалоба: боль в груди', 'боль в груди'), 
('жалоба: боль в животе', 'абдоминальная боль'), 
('жалоба: боль в животе', 'боль в животе'), 
('жалоба: боль в костях', 'боль в костях'), 
('жалоба: боль в мышцах', 'боль в мышцах'), 
('жалоба: боль в области пупка', 'боль в области пупка'), 
('жалоба: боль в плече', 'боль в плече'), 
('жалоба: боль в правом подреберье', 'боль и дискомфорт в правом подреберье'), 
('жалоба: боль в правом подреберье', 'дискомфорт в правом подреберье'), 
('жалоба: боль в правом подреберье', 'боль в правом подреберье'), 
('жалоба: боль в руке или плече', 'боль в руке или плече'), 
('жалоба: боль в суставах', 'боль в суставах'), 
('жалоба: боль в ухе', 'боль в ухе'), 
('жалоба: боль в эпигастральной области с иррадиацией в спину', 'боли в эпигастральной области с иррадиацией в спину'), 
('жалоба: боль в эпигастральной области с иррадиацией в спину', 'боли в верхней части живота отдающие в спину'), 
('жалоба: боль в эпигастральной области с иррадиацией в спину', 'боль в эпигастральной области с иррадиацией в спину'), 
('жалоба: боль в эпигастральной области с иррадиацией в спину', 'боль в верхней части живота отдающая в спину'), 
('жалоба: боль в эпигастрии', 'умеренная болезненность в эпигастральной области живота'), 
('жалоба: боль в эпигастрии', 'боли в эпигастрии'), 
('жалоба: боль в эпигастрии', 'боль в эпигастрии'), 
('жалоба: боль в эпигастрии', 'боль в верхнем отделе живота'), 
('жалоба: боль в эпигастрии', 'умеренная болезненность в эпигастральной области'), 
('жалоба: боль в эпигастрии', 'боль в верхней части живота'), 
('жалоба: боль в эпигастрии', 'дискомфорт в верхнем отделе живота'), 
('жалоба: боль в эпигастрии', 'боль в эпигастральной области'), 
('жалоба: боль и жжение в языке', 'боль и жжение в языке'), 
('жалоба: боль и жжение во рту', 'боль и жжение во рту'), 
('жалоба: боль и распирание в области языка', 'боль и распирание в области языка'), 
('жалоба: боль при глотании', 'боль при глотании'), 
('жалоба: боль при глотании', 'боль при глотании пищи'), 
('жалоба: боль при глотании', 'одинофагия'), 
('жалоба: головная боль', 'головная боль'), 
('жалоба: головокружение', 'головокружение'), 
('жалоба: горечь во рту', 'ощущение горечи во рту'), 
('жалоба: горечь во рту', 'горечь во рту'), 
('жалоба: жажда', 'постоянная жажда'), 
('жалоба: жажда', 'жажда'), 
('жалоба: желание употреблять в пищу что-то необычное и малосъедобное (мел, зубной порошок, уголь, глину, песок, лед, сырое тесто, фарш, крупу, …)', 'желание употреблять в пищу что-то необычное и малосъедобное (мел, зубной порошок, уголь, глину, песок, лед, сырое тесто, фарш, крупу, …)'), 
('жалоба: желчная колика', 'острая, интенсивная, нетерпимая, жгучая, распирающая, сжимающая, схваткообразная боль в эпигастрии и правом подреберье, заставляющая больного метаться в кровати, продолжительностью от 15 мин до 5 ч, достигая максимума в течение 20-30 мин'), 
('жалоба: желчная колика', 'желчная колика'), 
('жалоба: желчная колика', 'приступ желчной колики'), 
('жалоба: заложенность носа', 'заложенность носа'), 
('жалоба: запор', 'запоры'), 
('жалоба: запор', 'запор'), 
('жалоба: затруднения при глотании пищи', 'затруднения при глотании пищи'), 
('жалоба: звон в ушах', 'звон в ушах'), 
('жалоба: извращение вкуса', 'изменение вкуса'), 
('жалоба: извращение вкуса', 'извращение вкуса'), 
('жалоба: извращение обоняния', 'извращение обоняния'), 
('жалоба: изжога', 'изжога'), 
('жалоба: кожный зуд', 'кожный зуд'), 
('жалоба: кожный зуд', 'упорный кожный зуд'), 
('жалоба: ломота и боли в теле', 'ломота и боли в теле'), 
('жалоба: ломота и боли в теле', 'ломота в теле'), 
('жалоба: мышечная боль', 'миалгия'), 
('жалоба: мышечная боль', 'мышечная боль'), 
('жалоба: мышечная слабость', 'мышечная слабость'), 
('жалоба: непереносимость алкоголя', 'непереносимость алкоголя'), 
('жалоба: непереносимость газированных напитков', 'непереносимость газированных напитков'), 
('жалоба: непереносимость глютена', 'непереносимость глютена'), 
('жалоба: непереносимость глютена', 'целиакия'), 
('жалоба: непереносимость жареной пищи', 'непереносимость жареной пищи'), 
('жалоба: непереносимость жирной пищи', 'непереносимость жирной пищи'), 
('жалоба: непереносимость лактозы', 'непереваривание молока'), 
('жалоба: непереносимость лактозы', 'непереносимость лактозы'), 
('жалоба: непереносимость лактозы', 'неусвоение молока'), 
('жалоба: непереносимость острой пищи', 'непереносимость острой пищи'), 
('жалоба: непереносимость яиц', 'непереносимость яиц'), 
('жалоба: непреодолимые позывы на мочеиспускание', 'императивные позывы на мочеиспускание'), 
('жалоба: непреодолимые позывы на мочеиспускание', 'непреодолимые позывы на мочеиспускание'), 
('жалоба: непрерывная рвота не приносящая облегчение', 'непрерывная рвота не приносящая облегчение'), 
('жалоба: онемение конечностей', 'онемение и парестезии в конечностях'), 
('жалоба: онемение конечностей', 'онемение конечностей'), 
('жалоба: першение в горле', 'першение в горле'), 
('жалоба: полидипсия', 'неестественно сильная жажда'), 
('жалоба: полидипсия', 'полидипсия'), 
('жалоба: потеря вкуса', 'потеря вкуса'), 
('жалоба: потеря вкуса', 'агевзия'), 
('жалоба: потеря обоняния', 'потеря обоняния'), 
('жалоба: пристрастие к необычным запахам (бензин, ацетон, лаки, краски, гуталин, сигаретный дым, …)', 'пристрастие к необычным запахам (бензин, ацетон, лаки, краски, гуталин, сигаретный дым, …)'), 
('жалоба: раздражительность', 'раздражительность'), 
('жалоба: слабость', 'слабость'), 
('жалоба: слабость', 'общая слабость'), 
('жалоба: слабость', 'недомогание'), 
('жалоба: слабость сфинктеров', 'слабость сфинктеров'), 
('жалоба: слепое пятно в поле зрения', 'слепое пятно в поле зрения'), 
('жалоба: слепое пятно в поле зрения', 'слепое пятно в зрительном поле'), 
('жалоба: слепое пятно в поле зрения', 'скотома'), 
('жалоба: стресс', 'стресс'), 
('жалоба: стресс', 'стрессовые ситуации'), 
('жалоба: сухость во рту', 'сухость во рту'), 
('жалоба: тяжесть в эпигастрии', 'тяжесть в эпигастральной области'), 
('жалоба: тяжесть в эпигастрии', 'тяжесть в эпигастрии'), 
('жалоба: тяжесть в эпигастрии', 'чувство тяжести в животе после приема пищи'), 
('жалоба: тяжесть в эпигастрии', 'тяжесть в верхней части живота'), 
('жалоба: умеренный озноб', 'умеренный озноб'), 
('жалоба: усиление симптомов хронической сердечной недостаточности', 'усиление симптомов хронической сердечной недостаточности'), 
('жалоба: утомляемость', 'быстрая утомляемость'), 
('жалоба: утомляемость', 'утомляемость'), 
('жалоба: утомляемость', 'повышенная утомляемость'), 
('жалоба: чувство "комка" в горле', 'чувство "комка" в горле'), 
('жалоба: чувство раннего насыщения', 'чувство переполнения после еды'), 
('жалоба: чувство раннего насыщения', 'чувство быстрого насыщения'), 
('жалоба: чувство раннего насыщения', 'чувство раннего насыщения'), 
('жалоба: шум в ушах', 'шум в ушах'), 
}

vzNM = {
('C-реактивный белок', '', '', '', '', '', '', 100.0, 'мг/л', '', '', 'C-реактивный белок: от и более 100 мг/л', ''), 
('C-реактивный белок', '', '', '', '', '', 1.0, 20.0, 'мг/л', '', 'C-реактивный белок: от 1 до 20 мг/л', '', ''), 
('C-реактивный белок', '', '', '', '', '', 1.0, 3.0, 'мг/л', 'C-реактивный белок: до 1 мг/л', 'C-реактивный белок: от 1 до 3 мг/л', 'C-реактивный белок: от и более 3 мг/л', ''), 
('C-реактивный белок', '', '', '', '', '', '', 1.0, 'мг/л', '', '', 'C-реактивный белок: от и более 1 мг/л', ''), 
('IgA в сыворотке крови', '', 19, '', '', '', 0.7, 4.0, 'г/л', 'IgA в сыворотке крови: снижение', 'IgA в сыворотке крови: норма', 'IgA в сыворотке крови: повышение', ''), 
('Pb71', 'пол: мужской', 18, 45, '', '', 3.8, 5.1, '', '', 'Pb71: green', '', ''), 
('Pc23', '', 18, 45, '', '', 1.5, 3.7, '', '', 'Pc23: green', '', ''), 
('Tc', '', 50, 100, '', '', 9.23, 12.71, '', '', 'Tc: green', '', 401643), 
('Tc', '', 50, 100, '', '', 9.23, 12.71, '', '', 'Tc: green', '', 614273), 
('Tc', '', 50, 100, '', '', 9.23, 12.71, '', '', 'Tc: green', '', 278751), 
('Tc', '', 50, 100, '', '', 9.23, 12.71, '', '', 'Tc: green', '', 215721), 
('агрегация тромбоцитов', '', '', '', '', '', 25, 75, '%', 'агрегация тромбоцитов: снижение', 'агрегация тромбоцитов: норма', 'агрегация тромбоцитов: повышение', ''), 
('АЛТ', 'пол: мужской', 18, '', '', '', 0, 41.0, 'Ед/л', 'АЛТ: снижение', 'АЛТ: норма', 'АЛТ: повышение', ''), 
('АЛТ', '', 1, 7, '', '', 0, 29.0, 'Ед/л', 'АЛТ: снижение', 'АЛТ: норма', 'АЛТ: повышение', ''), 
('АЛТ', 'пол: женский', 18, '', '', '', 0, 33.0, 'Ед/л', 'АЛТ: снижение', 'АЛТ: норма', 'АЛТ: повышение', ''), 
('АЛТ', '', 7, 18, '', '', 0, 37.0, 'Ед/л', 'АЛТ: снижение', 'АЛТ: норма', 'АЛТ: повышение', ''), 
('АЛТ', '', 0, 1, '', '', 0, 56.0, 'Ед/л', 'АЛТ: снижение', 'АЛТ: норма', 'АЛТ: повышение', ''), 
('альбумин', '', 14, 18, '', '', 32.0, 45.0, 'г/л', 'альбумин: снижение', 'альбумин: норма', 'альбумин: повышение', ''), 
('альбумин', '', 1, 14, '', '', 38.0, 54.0, 'г/л', 'альбумин: снижение', 'альбумин: норма', 'альбумин: повышение', ''), 
('альбумин', '', 18, '', '', '', 35.0, 52.0, 'г/л', 'альбумин: снижение', 'альбумин: норма', 'альбумин: повышение', ''), 
('амилаза общая', '', '', '', '', '', 28, 100, 'Ед/л', 'амилаза общая: снижение', 'амилаза общая: норма', 'амилаза общая: повышение', ''), 
('амилаза панкреатическая', '', 0, 1, '', '', 0, 8.0, 'Ед/л', 'амилаза панкреатическая: снижение', 'амилаза панкреатическая: норма', 'амилаза панкреатическая: повышение', ''), 
('амилаза панкреатическая', '', 1, 10, '', '', 0, 31.0, 'Ед/л', 'амилаза панкреатическая: снижение', 'амилаза панкреатическая: норма', 'амилаза панкреатическая: повышение', ''), 
('амилаза панкреатическая', '', 18, '', '', '', 0, 53, 'Ед/л', 'амилаза панкреатическая: снижение', 'амилаза панкреатическая: норма', 'амилаза панкреатическая: повышение', ''), 
('амилаза панкреатическая', '', 10, 18, '', '', 0, 39.0, 'Ед/л', 'амилаза панкреатическая: снижение', 'амилаза панкреатическая: норма', 'амилаза панкреатическая: повышение', ''), 
('АСТ', 'пол: мужской', 18, '', '', '', '', 40, 'Ед/л', 'АСТ: снижение', 'АСТ: норма', 'АСТ: повышение', ''), 
('АСТ', 'пол: женский', 0, 1, '', '', '', 58, 'Ед/л', 'АСТ: снижение', 'АСТ: норма', 'АСТ: повышение', ''), 
('АСТ', 'пол: женский', 7, 13, '', '', '', 44, 'Ед/л', 'АСТ: снижение', 'АСТ: норма', 'АСТ: повышение', ''), 
('АСТ', 'пол: женский', 18, '', '', '', '', 32, 'Ед/л', 'АСТ: снижение', 'АСТ: норма', 'АСТ: повышение', ''), 
('АСТ', 'пол: женский', 4, 7, '', '', '', 48, 'Ед/л', 'АСТ: снижение', 'АСТ: норма', 'АСТ: повышение', ''), 
('АСТ', 'пол: женский', 1, 4, '', '', '', 59, 'Ед/л', 'АСТ: снижение', 'АСТ: норма', 'АСТ: повышение', ''), 
('АСТ', 'пол: женский', 13, 18, '', '', '', 39, 'Ед/л', 'АСТ: снижение', 'АСТ: норма', 'АСТ: повышение', ''), 
('АФП', 'пол: женский', 1, '', 12.0, 15.0, 15.0, 60.0, 'МЕ/мл', 'АФП: снижение при беременности', 'АФП: норма', 'АФП: повышение при беременности', ''), 
('АФП', 'пол: женский', 1, '', '', 0.0, 5.8, 500.0, 'МЕ/мл', '', 'АФП: от 5.8 до 500 МЕ/мл', '', ''), 
('АФП', 'пол: женский', 1, '', 30.0, 32.0, 100.0, 250.0, 'МЕ/мл', '', '', 'АФП: повышение', ''), 
('АФП', 'пол: женский', 1, '', 24.0, 28.0, 52.0, 140.0, 'МЕ/мл', 'АФП: снижение при беременности', 'АФП: норма', 'АФП: повышение при беременности', ''), 
('АФП', 'пол: женский', 1, '', 28.0, 30.0, 67.0, 150.0, 'МЕ/мл', 'АФП: снижение при беременности', 'АФП: норма', 'АФП: повышение при беременности', ''), 
('АФП', 'пол: женский', 1, '', 19.0, 24.0, 27.0, 125.0, 'МЕ/мл', 'АФП: снижение при беременности', 'АФП: норма', 'АФП: повышение при беременности', ''), 
('АФП', 'пол: женский', 1, '', 19.0, 24.0, 27.0, 125.0, 'МЕ/мл', '', '', 'АФП: повышение', ''), 
('АФП', 'пол: женский', 1, '', 24.0, 28.0, 52.0, 140.0, 'МЕ/мл', '', '', 'АФП: повышение', ''), 
('АФП', 'пол: женский', 1, '', 0.0, 12.0, 0.0, 15.0, 'МЕ/мл', '', '', 'АФП: повышение', ''), 
('АФП', 'пол: женский', 1, '', 15.0, 19.0, 15.0, 95.0, 'МЕ/мл', 'АФП: снижение при беременности', 'АФП: норма', 'АФП: повышение при беременности', ''), 
('АФП', 'пол: женский', 1, '', 12.0, 15.0, 15.0, 60.0, 'МЕ/мл', '', '', 'АФП: повышение', ''), 
('АФП', 'пол: мужской', 1, '', '', '', 0.0, 5.8, 'МЕ/мл', '', 'АФП: норма', 'АФП: повышение', ''), 
('АФП', 'пол: женский', 1, '', 0.0, 12.0, 0.0, 15.0, 'МЕ/мл', 'АФП: снижение при беременности', 'АФП: норма', 'АФП: повышение при беременности', ''), 
('АФП', 'пол: женский', 1, '', 30.0, 32.0, 100.0, 250.0, 'МЕ/мл', 'АФП: снижение при беременности', 'АФП: норма', 'АФП: повышение при беременности', ''), 
('АФП', 'пол: мужской', 1, '', '', '', 5.8, 500.0, 'МЕ/мл', '', 'АФП: от 5.8 до 500 МЕ/мл', '', ''), 
('АФП', 'пол: женский', 1, '', 15.0, 19.0, 15.0, 95.0, 'МЕ/мл', '', '', 'АФП: повышение', ''), 
('АФП', 'пол: женский', 1, '', '', 0.0, 5.8, 100.0, 'МЕ/мл', '', 'АФП: от 5.8 до 100 МЕ/мл', '', ''), 
('АФП', 'пол: мужской', 1, '', '', '', 5.8, 100.0, 'МЕ/мл', '', 'АФП: от 5.8 до 100 МЕ/мл', '', ''), 
('АФП', 'пол: женский', 1, '', '', 0.0, 0.0, 5.8, 'МЕ/мл', '', 'АФП: норма', 'АФП: повышение', ''), 
('АФП', 'пол: женский', 1, '', 28.0, 30.0, 67.0, 150.0, 'МЕ/мл', '', '', 'АФП: повышение', ''), 
('базофилы', '', '', '', '', '', 0.0, 0.08, '10^9/л', 'базофилы: снижение', 'базофилы: норма', 'базофилы: повышение', ''), 
('базофилы, %', '', '', '', '', '', 0.0, 1.2, '%', 'базофилы, %: снижение', 'базофилы, %: норма', 'базофилы, %: повышение', ''), 
('белок общий', '', 3, 18, '', '', 60.0, 80.0, 'г/л', 'белок общий: снижение', 'белок общий: норма', 'белок общий: повышение', ''), 
('белок общий', '', 18, '', '', '', 64.0, 83.0, 'г/л', 'белок общий: снижение', 'белок общий: норма', 'белок общий: повышение', ''), 
('белок общий', '', 1, 3, '', '', 56.0, 75.0, 'г/л', 'белок общий: снижение', 'белок общий: норма', 'белок общий: повышение', ''), 
('белок общий в моче за сутки, г/сутки', '', '', '', '', '', 0.0, 0.3, 'г/сутки', '', 'белок общий в моче за сутки: норма', 'белок общий в моче за сутки: повышение', ''), 
('белок общий в моче за сутки, мг/сутки', '', '', '', '', '', 0.0, 300.0, 'мг/сутки', '', 'белок общий в моче за сутки: норма', 'белок общий в моче за сутки: повышение', ''), 
('белок общий в моче после интенсивной физической нагрузки, г/сутки', '', '', '', '', '', 0.0, 0.3, 'г/сутки', '', 'белок общий в моче после интенсивной физической нагрузки: норма', 'белок общий в моче после интенсивной физической нагрузки: повышение', ''), 
('белок общий в моче после интенсивной физической нагрузки, мг/сутки', '', '', '', '', '', 0.0, 300.0, 'мг/сутки', '', 'белок общий в моче после интенсивной физической нагрузки: норма', 'белок общий в моче после интенсивной физической нагрузки: повышение', ''), 
('белок общий в моче, г/л', '', '', '', '', '', 0.0, 0.15, 'г/л', '', 'белок общий в моче: норма', 'белок общий в моче: повышение', ''), 
('белок общий в моче, мг/л', '', '', '', '', '', 0.0, 150.0, 'мг/л', '', 'белок общий в моче: норма', 'белок общий в моче: повышение', ''), 
('бета-глобулин', '', '', '', '', '', 7.9, 13.7, '%', 'бета-глобулин: снижение', 'бета-глобулин: норма', 'бета-глобулин: повышение', ''), 
('билирубин общий', '', 1, '', '', '', 0, 21.0, 'мкмоль/л', 'билирубин общий: снижение', 'билирубин общий: норма', 'билирубин общий: повышение', ''), 
('билирубин прямой', '', '', '', '', '', '', 5.0, 'мкмоль/л', '', 'билирубин прямой: норма', 'билирубин прямой: повышение', ''), 
('витамин B12', '', '', '', '', '', 197.0, 771.0, 'пг/мл', 'витамин B12: снижение', 'витамин B12: норма', 'витамин B12: повышение', ''), 
('гамма-глобулин', '', '', '', '', '', 11.1, 18.8, '%', 'гамма-глобулин: снижение', 'гамма-глобулин: норма', 'гамма-глобулин: повышение', ''), 
('гамма-ГТП', '', 3, 6, '', '', 0.0, 23.0, 'Ед/л', 'гамма-ГТП: снижение', 'гамма-ГТП: норма', 'гамма-ГТП: повышение', ''), 
('гамма-ГТП', 'пол: женский', 12, 17, '', '', 0, 33.0, 'Ед/л', '', 'гамма-ГТП: норма', 'гамма-ГТП: повышение', ''), 
('гамма-ГТП', '', 1, 3, '', '', 0.0, 18.0, 'Ед/л', 'гамма-ГТП: снижение', 'гамма-ГТП: норма', 'гамма-ГТП: повышение', ''), 
('гамма-ГТП', 'пол: мужской', 12, 17, '', '', 0.0, 45.0, 'Ед/л', '', 'гамма-ГТП: норма', 'гамма-ГТП: повышение', ''), 
('гамма-ГТП', 'пол: женский', 17, '', '', '', 6.0, 42.0, 'Ед/л', 'гамма-ГТП: снижение', 'гамма-ГТП: норма', 'гамма-ГТП: повышение', ''), 
('гамма-ГТП', 'пол: мужской', 17, '', '', '', 10.0, 71.0, 'Ед/л', 'гамма-ГТП: снижение', 'гамма-ГТП: норма', 'гамма-ГТП: повышение', ''), 
('гамма-ГТП', '', 6, 12, '', '', 0.0, 17.0, 'Ед/л', 'гамма-ГТП: снижение', 'гамма-ГТП: норма', 'гамма-ГТП: повышение', ''), 
('гастрин 17 (базальный)', '', '', '', '', '', '', 5.0, 'пмоль/л', '', '', 'гастрин 17 (базальный): от и более 5 пмоль/л', ''), 
('гастрин 17 (базальный)', '', '', '', '', '', 1.0, 7.0, 'пмоль/л', 'гастрин 17 (базальный): снижение', 'гастрин 17 (базальный): норма', 'гастрин 17 (базальный): повышение', ''), 
('гастрин 17 (базальный)', '', '', '', '', '', 10.0, 20.0, 'пмоль/л', '', 'гастрин 17 (базальный): от 10 до 20 пмоль/л', '', ''), 
('гастрин 17 (базальный)', '', '', '', '', '', 7.0, 10.0, 'пмоль/л', '', 'гастрин 17 (базальный): от 7 до 10 пмоль/л', '', ''), 
('гастрин 17 (базальный)', '', '', '', '', '', '', 20.0, 'пмоль/л', '', '', 'гастрин 17 (базальный): от и более 20 пмоль/л', ''), 
('гематокрит', 'пол: женский', '', '', '', '', 35.0, 45.0, '%', 'гематокрит: снижение', 'гематокрит: норма', 'гематокрит: повышение', 11.278), 
('гематокрит', 'пол: мужской', '', '', '', '', 3.9, 4.9, 'л/л', 'гематокрит: снижение', 'гематокрит: норма', 'гематокрит: повышение', 12.478), 
('гематокрит', 'пол: женский', '', '', '', '', 3.5, 4.5, 'л/л', 'гематокрит: снижение', 'гематокрит: норма', 'гематокрит: повышение', 11.278), 
('гематокрит', 'пол: мужской', '', '', '', '', 39.0, 49.0, '%', 'гематокрит: снижение', 'гематокрит: норма', 'гематокрит: повышение', 12.478), 
('гемоглобин', '', 1, 5, '', '', 11.0, 14.0, 'г/дл', 'гемоглобин: снижение', 'гемоглобин: норма', 'гемоглобин: повышение', 35.333), 
('гемоглобин', 'пол: мужской', 18, 45, '', '', 9, 13.2, 'г/дл', '', 'гемоглобин: от 9 г/дл и ниже нормы', '', 'neS4'), 
('гемоглобин', 'пол: женский', 12, 15, '', '', 11.5, 15, 'г/дл', 'гемоглобин: снижение', 'гемоглобин: норма', 'гемоглобин: повышение', 37.222), 
('гемоглобин', 'пол: мужской', 65, '', '', '', 90, 126, 'г/л', '', 'гемоглобин: от 90 г/л и ниже нормы', '', 'neS4'), 
('гемоглобин', 'пол: женский', 65, '', '', '', 117, 161, 'г/л', 'гемоглобин: снижение', 'гемоглобин: норма', 'гемоглобин: повышение', 38.522), 
('гемоглобин', 'пол: женский', 12, 15, '', '', 9, 11.5, 'г/дл', '', 'гемоглобин: от 9 г/дл и ниже нормы', '', 'neS4'), 
('гемоглобин', 'пол: женский', 12, 15, '', '', 90, 115, 'г/л', '', 'гемоглобин: от 90 г/л и ниже нормы', '', 'neS4'), 
('гемоглобин', '', 1, 5, '', '', 110.0, 140.0, 'г/л', 'гемоглобин: снижение', 'гемоглобин: норма', 'гемоглобин: повышение', 35.333), 
('гемоглобин', 'пол: мужской', 65, '', '', '', 9, 12.6, 'г/дл', '', 'гемоглобин: от 9 г/дл и ниже нормы', '', 'neS4'), 
('гемоглобин', 'пол: мужской', 12, 15, '', '', 120.0, 160.0, 'г/л', 'гемоглобин: снижение', 'гемоглобин: норма', 'гемоглобин: повышение', 39.111), 
('гемоглобин', 'пол: женский', 45, 65, '', '', 117, 160, 'г/л', 'гемоглобин: снижение', 'гемоглобин: норма', 'гемоглобин: повышение', 38.444), 
('гемоглобин', 'пол: мужской', 45, 65, '', '', 9, 13.1, 'г/дл', '', 'гемоглобин: от 9 г/дл и ниже нормы', '', 'neS4'), 
('гемоглобин', '', 10, 12, '', '', 12, 15, 'г/дл', 'гемоглобин: снижение', 'гемоглобин: норма', 'гемоглобин: повышение', 38.333), 
('гемоглобин', 'пол: женский', 15, 18, '', '', 117, 153, 'г/л', 'гемоглобин: снижение', 'гемоглобин: норма', 'гемоглобин: повышение', 37.9), 
('гемоглобин', 'пол: мужской', 12, 15, '', '', 12.0, 16.0, 'г/дл', 'гемоглобин: снижение', 'гемоглобин: норма', 'гемоглобин: повышение', 39.111), 
('гемоглобин', '', 10, 12, '', '', 90, 120, 'г/л', '', 'гемоглобин: от 90 г/л и ниже нормы', '', 'neS4'), 
('гемоглобин', 'пол: женский', 15, 18, '', '', 11.7, 15.3, 'г/дл', 'гемоглобин: снижение', 'гемоглобин: норма', 'гемоглобин: повышение', 37.9), 
('гемоглобин', 'пол: мужской', 18, 45, '', '', 90, 132, 'г/л', '', 'гемоглобин: от 90 г/л и ниже нормы', '', 'neS4'), 
('гемоглобин', 'пол: женский', 12, 15, '', '', 115.0, 150.0, 'г/л', 'гемоглобин: снижение', 'гемоглобин: норма', 'гемоглобин: повышение', 37.222), 
('гемоглобин', 'пол: мужской', 45, 65, '', '', 131, 172, 'г/л', 'гемоглобин: снижение', 'гемоглобин: норма', 'гемоглобин: повышение', 42.489), 
('гемоглобин', '', '', '', '', '', 70, 90, 'г/л', 'гемоглобин: до 70 г/л', 'гемоглобин: от 70 до 90 г/л', '', 'neS4'), 
('гемоглобин', 'пол: женский', 45, 65, '', '', 11.7, 16, 'г/дл', 'гемоглобин: снижение', 'гемоглобин: норма', 'гемоглобин: повышение', 38.444), 
('гемоглобин', 'пол: мужской', 65, '', '', '', 126, 174, 'г/л', 'гемоглобин: снижение', 'гемоглобин: норма', 'гемоглобин: повышение', 41.533), 
('гемоглобин', '', 5, 10, '', '', 115.0, 145.0, 'г/л', 'гемоглобин: снижение', 'гемоглобин: норма', 'гемоглобин: повышение', 36.833), 
('гемоглобин', 'пол: мужской', 15, 18, '', '', 117.0, 166.0, 'г/л', 'гемоглобин: снижение', 'гемоглобин: норма', 'гемоглобин: повышение', 38.911), 
('гемоглобин', 'пол: женский', 18, 45, '', '', 117.0, 155.0, 'г/л', 'гемоглобин: снижение', 'гемоглобин: норма', 'гемоглобин: повышение', 38.056), 
('гемоглобин', 'пол: женский', 45, 65, '', '', 9, 11.7, 'г/дл', '', 'гемоглобин: от 9 г/дл и ниже нормы', '', 'neS4'), 
('гемоглобин', 'пол: мужской', 45, 65, '', '', 13.1, 17.2, 'г/дл', 'гемоглобин: снижение', 'гемоглобин: норма', 'гемоглобин: повышение', 42.489), 
('гемоглобин', '', '', '', '', '', 7, 9, 'г/дл', 'гемоглобин: до 7 г/дл', 'гемоглобин: от 7 до 9 г/дл', '', 'neS4'), 
('гемоглобин', '', 5, 10, '', '', 11.5, 14.5, 'г/дл', 'гемоглобин: снижение', 'гемоглобин: норма', 'гемоглобин: повышение', 36.833), 
('гемоглобин', 'пол: мужской', 45, 65, '', '', 90, 131, 'г/л', '', 'гемоглобин: от 90 г/л и ниже нормы', '', 'neS4'), 
('гемоглобин', 'пол: мужской', 18, 45, '', '', 132, 173, 'г/л', 'гемоглобин: снижение', 'гемоглобин: норма', 'гемоглобин: повышение', 42.789), 
('гемоглобин', 'пол: мужской', 65, '', '', '', 12.6, 17.4, 'г/дл', 'гемоглобин: снижение', 'гемоглобин: норма', 'гемоглобин: повышение', 41.533), 
('гемоглобин', '', 10, 12, '', '', 9, 12, 'г/дл', '', 'гемоглобин: от 9 г/дл и ниже нормы', '', 'neS4'), 
('гемоглобин', '', 10, 12, '', '', 120, 150, 'г/л', 'гемоглобин: снижение', 'гемоглобин: норма', 'гемоглобин: повышение', 38.333), 
('гемоглобин', 'пол: женский', 65, '', '', '', 9, 11.7, 'г/дл', '', 'гемоглобин: от 9 г/дл и ниже нормы', '', 'neS4'), 
('гемоглобин', 'пол: женский', 45, 65, '', '', 90, 117, 'г/л', '', 'гемоглобин: от 90 г/л и ниже нормы', '', 'neS4'), 
('гемоглобин', 'пол: женский', 15, 18, '', '', 90, 117, 'г/л', '', 'гемоглобин: от 90 г/л и ниже нормы', '', 'neS4'), 
('гемоглобин', 'пол: женский', 65, '', '', '', 90, 117, 'г/л', '', 'гемоглобин: от 90 г/л и ниже нормы', '', 'neS4'), 
('гемоглобин', 'пол: мужской', 18, 45, '', '', 13.2, 17.3, 'г/дл', 'гемоглобин: снижение', 'гемоглобин: норма', 'гемоглобин: повышение', 42.789), 
('гемоглобин', 'пол: женский', 15, 18, '', '', 9, 11.7, 'г/дл', '', 'гемоглобин: от 9 г/дл и ниже нормы', '', 'neS4'), 
('гемоглобин', 'пол: мужской', 15, 18, '', '', 11.7, 16.6, 'г/дл', 'гемоглобин: снижение', 'гемоглобин: норма', 'гемоглобин: повышение', 38.911), 
('гемоглобин', 'пол: женский', 65, '', '', '', 11.7, 16.1, 'г/дл', 'гемоглобин: снижение', 'гемоглобин: норма', 'гемоглобин: повышение', 38.522), 
('гемоглобин', 'пол: женский', 18, 45, '', '', 11.7, 15.5, 'г/дл', 'гемоглобин: снижение', 'гемоглобин: норма', 'гемоглобин: повышение', 38.056), 
('гликированный гемоглобин', '', '', '', '', '', 6.0, 6.5, '%', 'гликированный гемоглобин: до 6%', 'гликированный гемоглобин: от 6 до 6,5%', 'гликированный гемоглобин: от 6,5%', ''), 
('глюкоза', '', '', 14, '', '', 3.3, 5.6, 'ммоль/л', 'глюкоза: снижение', 'глюкоза: норма', 'глюкоза: повышение', ''), 
('глюкоза', '', 14, '', '', 0, 4.1, 6.1, 'ммоль/л', 'глюкоза: снижение', 'глюкоза: норма', 'глюкоза: повышение', ''), 
('глюкоза', 'пол: женский', '', '', 0, '', 4.1, 5.1, 'ммоль/л', 'глюкоза: снижение', 'глюкоза: норма', 'глюкоза: повышение', ''), 
('гомоцистеин', 'пол: женский', '', '', '', '', 4.44, 13.56, 'мкмоль/л', 'гомоцистеин: снижение', 'гомоцистеин: норма', 'гомоцистеин: повышение', ''), 
('гомоцистеин', 'пол: мужской', '', '', '', '', 5.46, 16.2, 'мкмоль/л', 'гомоцистеин: снижение', 'гомоцистеин: норма', 'гомоцистеин: повышение', ''), 
('железо', 'пол: мужской', 1, 4, '', '', 5.2, 16.3, 'мкмоль/л', 'железо: снижение', 'железо: норма', 'железо: повышение', ''), 
('железо', 'пол: женский', 18, '', '', '', 6.6, 26, 'мкмоль/л', 'железо: снижение', 'железо: норма', 'железо: повышение', ''), 
('железо', 'пол: женский', 4, 7, '', '', 5, 16.7, 'мкмоль/л', 'железо: снижение', 'железо: норма', 'железо: повышение', ''), 
('железо', 'пол: женский', 16, 18, '', '', 5.9, 18.3, 'мкмоль/л', 'железо: снижение', 'железо: норма', 'железо: повышение', ''), 
('железо', 'пол: мужской', 4, 7, '', '', 4.5, 20.6, 'мкмоль/л', 'железо: снижение', 'железо: норма', 'железо: повышение', ''), 
('железо', 'пол: мужской', 13, 16, '', '', 4.7, 19.7, 'мкмоль/л', 'железо: снижение', 'железо: норма', 'железо: повышение', ''), 
('железо', 'пол: мужской', 10, 13, '', '', 5, 20, 'мкмоль/л', 'железо: снижение', 'железо: норма', 'железо: повышение', ''), 
('железо', 'пол: женский', 7, 10, '', '', 5.4, 18.6, 'мкмоль/л', 'железо: снижение', 'железо: норма', 'железо: повышение', ''), 
('железо', 'пол: женский', 13, 16, '', '', 5.4, 19.5, 'мкмоль/л', 'железо: снижение', 'железо: норма', 'железо: повышение', ''), 
('железо', 'пол: мужской', 18, '', '', '', 11, 28, 'мкмоль/л', 'железо: снижение', 'железо: норма', 'железо: повышение', ''), 
('железо', 'пол: мужской', 16, 18, '', '', 4.8, 24.7, 'мкмоль/л', 'железо: снижение', 'железо: норма', 'железо: повышение', ''), 
('железо', 'пол: мужской', 7, 10, '', '', 4.8, 17.2, 'мкмоль/л', 'железо: снижение', 'железо: норма', 'железо: повышение', ''), 
('железо', 'пол: женский', 10, 13, '', '', 5.7, 18.6, 'мкмоль/л', 'железо: снижение', 'железо: норма', 'железо: повышение', ''), 
('железо', 'пол: женский', 1, 4, '', '', 4.5, 18.1, 'мкмоль/л', 'железо: снижение', 'железо: норма', 'железо: повышение', ''), 
('желчные кислоты', '', '', '', '', '', 0, 10.0, 'мкмоль/л', 'желчные кислоты: снижение', 'желчные кислоты: норма', 'желчные кислоты: повышение', ''), 
('калий', '', '', '', '', '', 3.5, 5.1, 'ммоль/л', 'калий: снижение', 'калий: норма', 'калий: повышение', ''), 
('кальций общий', '', 60, 90, '', '', 2.22, 2.55, 'ммоль/л', 'кальций общий: снижение', 'кальций общий: норма', 'кальций общий: повышение', ''), 
('кальций общий', '', 1, 2, '', '', 2.25, 2.75, 'ммоль/л', 'кальций общий: снижение', 'кальций общий: норма', 'кальций общий: повышение', ''), 
('кальций общий', '', 2, 12, '', '', 2.2, 2.7, 'ммоль/л', 'кальций общий: снижение', 'кальций общий: норма', 'кальций общий: повышение', ''), 
('кальций общий', '', 18, 60, '', '', 2.15, 2.5, 'ммоль/л', 'кальций общий: снижение', 'кальций общий: норма', 'кальций общий: повышение', ''), 
('кальций общий', '', 90, '', '', '', 2.05, 2.4, 'ммоль/л', 'кальций общий: снижение', 'кальций общий: норма', 'кальций общий: повышение', ''), 
('кальций общий', '', 12, 18, '', '', 2.1, 2.55, 'ммоль/л', 'кальций общий: снижение', 'кальций общий: норма', 'кальций общий: повышение', ''), 
('коэффициент атерогенности', '', '', '', '', '', 0, 3.5, '', 'коэффициент атерогенности: снижение', 'коэффициент атерогенности: норма', 'коэффициент атерогенности: повышение', ''), 
('коэффициент больших тромбоцитов (P-LCR)', '', '', '', '', '', 13.0, 43.0, '%', 'коэффициент больших тромбоцитов (P-LCR): снижение', 'коэффициент больших тромбоцитов (P-LCR): норма', 'коэффициент больших тромбоцитов (P-LCR): повышение', ''), 
('креатинин', '', 9, 11, '', '', 34, 65, 'мкмоль/л', 'креатинин: снижение', 'креатинин: норма', 'креатинин: повышение', ''), 
('креатинин', '', 1, 3, '', '', 21, 36, 'мкмоль/л', 'креатинин: снижение', 'креатинин: норма', 'креатинин: повышение', ''), 
('креатинин', '', 7, 9, '', '', 35, 53, 'мкмоль/л', 'креатинин: снижение', 'креатинин: норма', 'креатинин: повышение', ''), 
('креатинин', 'пол: женский', 15, '', '', '', 44, 80, 'мкмоль/л', 'креатинин: снижение', 'креатинин: норма', 'креатинин: повышение', ''), 
('креатинин', 'пол: мужской', 15, '', '', '', 62, 106, 'мкмоль/л', 'креатинин: снижение', 'креатинин: норма', 'креатинин: повышение', ''), 
('креатинин', '', 5, 7, '', '', 28, 52, 'мкмоль/л', 'креатинин: снижение', 'креатинин: норма', 'креатинин: повышение', ''), 
('креатинин', '', 11, 13, '', '', 46, 70, 'мкмоль/л', 'креатинин: снижение', 'креатинин: норма', 'креатинин: повышение', ''), 
('креатинин', '', 3, 5, '', '', 27, 42, 'мкмоль/л', 'креатинин: снижение', 'креатинин: норма', 'креатинин: повышение', ''), 
('креатинин', '', 13, 15, '', '', 50, 77, 'мкмоль/л', 'креатинин: снижение', 'креатинин: норма', 'креатинин: повышение', ''), 
('креатинкиназа', 'пол: женский', 12, 17, '', '', 0, 123, 'Ед/л', 'креатинкиназа: снижение', 'креатинкиназа: норма', 'креатинкиназа: повышение', ''), 
('креатинкиназа', 'пол: мужской', 6, 12, '', '', 0, 247, 'Ед/л', 'креатинкиназа: снижение', 'креатинкиназа: норма', 'креатинкиназа: повышение', ''), 
('креатинкиназа', '', 1, 3, '', '', 0, 228, 'Ед/л', 'креатинкиназа: снижение', 'креатинкиназа: норма', 'креатинкиназа: повышение', ''), 
('креатинкиназа', '', 3, 6, '', '', 0, 149, 'Ед/л', 'креатинкиназа: снижение', 'креатинкиназа: норма', 'креатинкиназа: повышение', ''), 
('креатинкиназа', 'пол: женский', 17, '', '', '', 0, 167, 'Ед/л', 'креатинкиназа: снижение', 'креатинкиназа: норма', 'креатинкиназа: повышение', ''), 
('креатинкиназа', 'пол: мужской', 17, '', '', '', 0, 190, 'Ед/л', 'креатинкиназа: снижение', 'креатинкиназа: норма', 'креатинкиназа: повышение', ''), 
('креатинкиназа', 'пол: мужской', 12, 17, '', '', 0, 270, 'Ед/л', 'креатинкиназа: снижение', 'креатинкиназа: норма', 'креатинкиназа: повышение', ''), 
('креатинкиназа', 'пол: женский', 6, 12, '', '', 0, 154, 'Ед/л', 'креатинкиназа: снижение', 'креатинкиназа: норма', 'креатинкиназа: повышение', ''), 
('лактат', '', '', '', '', '', 0.5, 22, 'ммоль/л', 'лактат: снижение', 'лактат: норма', 'лактат: повышение', ''), 
('лактатдегидрогеназа', '', 1, 3, '', '', 0, 344, 'Ед/л', 'лактатдегидрогеназа: снижение', 'лактатдегидрогеназа: норма', 'лактатдегидрогеназа: повышение', ''), 
('лактатдегидрогеназа', 'пол: женский', 17, '', '', '', 135, 214, 'Ед/л', 'лактатдегидрогеназа: снижение', 'лактатдегидрогеназа: норма', 'лактатдегидрогеназа: повышение', ''), 
('лактатдегидрогеназа', '', 3, 6, '', '', 0, 314, 'Ед/л', 'лактатдегидрогеназа: снижение', 'лактатдегидрогеназа: норма', 'лактатдегидрогеназа: повышение', ''), 
('лактатдегидрогеназа', '', 0, 1, '', '', 0, 451, 'Ед/л', 'лактатдегидрогеназа: снижение', 'лактатдегидрогеназа: норма', 'лактатдегидрогеназа: повышение', ''), 
('лактатдегидрогеназа', '', 12, 17, '', '', 0, 279, 'Ед/л', 'лактатдегидрогеназа: снижение', 'лактатдегидрогеназа: норма', 'лактатдегидрогеназа: повышение', ''), 
('лактатдегидрогеназа', '', 6, 12, '', '', 0, 332, 'Ед/л', 'лактатдегидрогеназа: снижение', 'лактатдегидрогеназа: норма', 'лактатдегидрогеназа: повышение', ''), 
('лактатдегидрогеназа', 'пол: мужской', 17, '', '', '', 135, 225, 'Ед/л', 'лактатдегидрогеназа: снижение', 'лактатдегидрогеназа: норма', 'лактатдегидрогеназа: повышение', ''), 
('латентная железосвязывающая способность сыворотки крови', '', '', '', '', '', 20, 62, 'мкмоль/л', 'латентная железосвязывающая способность сыворотки крови: снижение', 'латентная железосвязывающая способность сыворотки крови: норма', 'латентная железосвязывающая способность сыворотки крови: повышение', ''), 
('лейкоциты', '', 4, 6, '', '', 5000, 14500, 'клеток/мкл', 'лейкоциты: снижение', 'лейкоциты: норма', 'лейкоциты: повышение', 1122.389), 
('лейкоциты', '', 6, 10, '', '', 4.5, 13.5, '10^9/л', 'лейкоциты: снижение', 'лейкоциты: норма', 'лейкоциты: повышение', 1010.5), 
('лейкоциты', '', 6, 10, '', '', 4500, 13500, 'клеток/мкл', 'лейкоциты: снижение', 'лейкоциты: норма', 'лейкоциты: повышение', 1010.5), 
('лейкоциты', '', 4, 6, '', '', 5, 14.5, '10^9/л', 'лейкоциты: снижение', 'лейкоциты: норма', 'лейкоциты: повышение', 1122.389), 
('лейкоциты', '', 1, 2, '', '', 6, 17, '10^9/л', 'лейкоциты: снижение', 'лейкоциты: норма', 'лейкоциты: повышение', 1346.556), 
('лейкоциты', '', 16, '', '', '', 4000, 10000, 'клеток/мкл', 'лейкоциты: снижение', 'лейкоциты: норма', 'лейкоциты: повышение', 896.667), 
('лейкоциты', '', 16, '', '', '', 4.0, 10.0, '10^9/л', 'лейкоциты: снижение', 'лейкоциты: норма', 'лейкоциты: повышение', 896.667), 
('лейкоциты', '', 1, 2, '', '', 6000, 17000, 'клеток/мкл', 'лейкоциты: снижение', 'лейкоциты: норма', 'лейкоциты: повышение', 1346.556), 
('лейкоциты', '', 0, 1, '', '', 6, 17.5, '10^9/л', 'лейкоциты: снижение', 'лейкоциты: норма', 'лейкоциты: повышение', 1346.944), 
('лейкоциты', '', 2, 4, '', '', 5.5, 15.5, '10^9/л', 'лейкоциты: снижение', 'лейкоциты: норма', 'лейкоциты: повышение', 1234.278), 
('лейкоциты', '', 0, 1, '', '', 6000, 17500, 'клеток/мкл', 'лейкоциты: снижение', 'лейкоциты: норма', 'лейкоциты: повышение', 1346.944), 
('лейкоциты', '', 2, 4, '', '', 5500, 15500, 'клеток/мкл', 'лейкоциты: снижение', 'лейкоциты: норма', 'лейкоциты: повышение', 1234.278), 
('лейкоциты', '', 10, 16, '', '', 4500, 13000, 'клеток/мкл', 'лейкоциты: снижение', 'лейкоциты: норма', 'лейкоциты: повышение', 1010.111), 
('лейкоциты', '', 10, 16, '', '', 4.5, 13, '10^9/л', 'лейкоциты: снижение', 'лейкоциты: норма', 'лейкоциты: повышение', 1010.111), 
('лимфоциты', '', 8, 10, '', '', 1.5, 6.5, '10^9/л', 'лимфоциты: снижение', 'лимфоциты: норма', 'лимфоциты: повышение', 338.389), 
('лимфоциты', '', 10, 16, '', '', 1.2, 5.2, '10^9/л', 'лимфоциты: снижение', 'лимфоциты: норма', 'лимфоциты: повышение', 270.711), 
('лимфоциты', '', 1, 2, '', '', 3000, 9500, 'клеток/мкл', 'лимфоциты: снижение', 'лимфоциты: норма', 'лимфоциты: повышение', 674.056), 
('лимфоциты', '', 2, 4, '', '', 2, 8, '10^9/л', 'лимфоциты: снижение', 'лимфоциты: норма', 'лимфоциты: повышение', 450.667), 
('лимфоциты', '', 0, 1, '', '', 2, 11, '10^9/л', 'лимфоциты: снижение', 'лимфоциты: норма', 'лимфоциты: повышение', 453.0), 
('лимфоциты', '', 4, 6, '', '', 1.5, 7, '10^9/л', 'лимфоциты: снижение', 'лимфоциты: норма', 'лимфоциты: повышение', 338.778), 
('лимфоциты', '', 16, '', '', '', 1.0, 4.8, '10^9/л', 'лимфоциты: снижение', 'лимфоциты: норма', 'лимфоциты: повышение', 225.956), 
('лимфоциты', '', 10, 16, '', '', 1200, 5200, 'клеток/мкл', 'лимфоциты: снижение', 'лимфоциты: норма', 'лимфоциты: повышение', 270.711), 
('лимфоциты', '', 6, 8, '', '', 1.5, 6.8, '10^9/л', 'лимфоциты: снижение', 'лимфоциты: норма', 'лимфоциты: повышение', 338.622), 
('лимфоциты', '', 8, 10, '', '', 1500, 6500, 'клеток/мкл', 'лимфоциты: снижение', 'лимфоциты: норма', 'лимфоциты: повышение', 338.389), 
('лимфоциты', '', 0, 1, '', '', 2000, 11000, 'клеток/мкл', 'лимфоциты: снижение', 'лимфоциты: норма', 'лимфоциты: повышение', 453.0), 
('лимфоциты', '', 1, 2, '', '', 3, 9.5, '10^9/л', 'лимфоциты: снижение', 'лимфоциты: норма', 'лимфоциты: повышение', 674.056), 
('лимфоциты', '', 2, 4, '', '', 2000, 8000, 'клеток/мкл', 'лимфоциты: снижение', 'лимфоциты: норма', 'лимфоциты: повышение', 450.667), 
('лимфоциты', '', 16, '', '', '', 1000.0, 4800.0, 'клеток/мкл', 'лимфоциты: снижение', 'лимфоциты: норма', 'лимфоциты: повышение', 225.956), 
('лимфоциты', '', 4, 6, '', '', 1500, 7000, 'клеток/мкл', 'лимфоциты: снижение', 'лимфоциты: норма', 'лимфоциты: повышение', 338.778), 
('лимфоциты', '', 6, 8, '', '', 1500, 6800, 'клеток/мкл', 'лимфоциты: снижение', 'лимфоциты: норма', 'лимфоциты: повышение', 338.622), 
('лимфоциты, %', '', 16, '', '', '', 19.0, 37.0, '%', 'лимфоциты, %: снижение', 'лимфоциты, %: норма', 'лимфоциты, %: повышение', 4.51), 
('лимфоциты, %', '', 16, '', '', '', 0.19, 0.37, 'доля', 'лимфоциты, %: снижение', 'лимфоциты, %: норма', 'лимфоциты, %: повышение', 4.51), 
('липаза', '', 18, '', '', '', 13, 60, 'Ед/л', 'липаза: снижение', 'липаза: норма', 'липаза: повышение', ''), 
('липаза', '', 13, 18, '', '', 0, 55, 'Ед/л', 'липаза: снижение', 'липаза: норма', 'липаза: повышение', ''), 
('липаза', '', 1, 13, '', '', 0, 31, 'Ед/л', 'липаза: снижение', 'липаза: норма', 'липаза: повышение', ''), 
('ЛПВП', 'пол: мужской', '', '', '', '', 1.0, '', 'ммоль/л', 'ЛПВП: снижение', 'ЛПВП: норма', 'ЛПВП: повышение', ''), 
('ЛПВП', 'пол: женский', '', '', '', '', 1.2, '', 'ммоль/л', 'ЛПВП: снижение', 'ЛПВП: норма', 'ЛПВП: повышение', ''), 
('ЛПНП', '', '', '', '', '', 0, 3.0, 'ммоль/л', 'ЛПНП: снижение', 'ЛПНП: норма', 'ЛПНП: повышение', ''), 
('магний', '', 1, 6, '', '', 0.7, 0.95, 'ммоль/л', 'магний: снижение', 'магний: норма', 'магний: повышение', ''), 
('магний', '', 12, 20, '', '', 0.7, 0.91, 'ммоль/л', 'магний: снижение', 'магний: норма', 'магний: повышение', ''), 
('магний', '', 20, '', '', '', 0.66, 1.07, 'ммоль/л', 'магний: снижение', 'магний: норма', 'магний: повышение', ''), 
('магний', '', 6, 12, '', '', 0.7, 0.86, 'ммоль/л', 'магний: снижение', 'магний: норма', 'магний: повышение', ''), 
('миоглобин', 'пол: мужской', '', '', '', '', 23, 72, 'мкг/л', 'миоглобин: снижение', 'миоглобин: норма', 'миоглобин: повышение', ''), 
('миоглобин', 'пол: женский', '', '', '', '', 19, 51, 'мкг/л', 'миоглобин: снижение', 'миоглобин: норма', 'миоглобин: повышение', ''), 
('моноциты', '', 16, '', '', '', 0.05, 0.82, '10^9/л', 'моноциты: снижение', 'моноциты: норма', 'моноциты: повышение', 11.749), 
('моноциты', '', 16, '', '', '', 50.0, 820.0, 'клеток/мкл', 'моноциты: снижение', 'моноциты: норма', 'моноциты: повышение', 11.749), 
('моноциты, %', '', 2, '', '', '', 0.03, 0.11, 'доля', 'моноциты, %: снижение', 'моноциты, %: норма', 'моноциты, %: повышение', 0.752), 
('моноциты, %', '', 2, '', '', '', 3.0, 11.0, '%', 'моноциты, %: снижение', 'моноциты, %: норма', 'моноциты, %: повышение', 0.752), 
('мочевая кислота', 'пол: женский', '', '', '', '', 142.8, 339.2, 'мкмоль/л', 'мочевая кислота: снижение', 'мочевая кислота: норма', 'мочевая кислота: повышение', ''), 
('мочевая кислота', 'пол: мужской', '', '', '', '', 202.3, 416.5, 'мкмоль/л', 'мочевая кислота: снижение', 'мочевая кислота: норма', 'мочевая кислота: повышение', ''), 
('мочевина', '', 4, 14, '', '', 2.5, 6, 'ммоль/л', 'мочевина: снижение', 'мочевина: норма', 'мочевина: повышение', ''), 
('мочевина', 'пол: мужской', 20, 50, '', '', 3.2, 7.3, 'ммоль/л', 'мочевина: снижение', 'мочевина: норма', 'мочевина: повышение', ''), 
('мочевина', '', 14, 20, '', '', 2.9, 7.5, 'ммоль/л', 'мочевина: снижение', 'мочевина: норма', 'мочевина: повышение', ''), 
('мочевина', 'пол: женский', 50, '', '', '', 3.5, 7.2, 'ммоль/л', 'мочевина: снижение', 'мочевина: норма', 'мочевина: повышение', ''), 
('мочевина', 'пол: женский', 20, 50, '', '', 2.6, 6.7, 'ммоль/л', 'мочевина: снижение', 'мочевина: норма', 'мочевина: повышение', ''), 
('мочевина', 'пол: мужской', 50, '', '', '', 3, 9.2, 'ммоль/л', 'мочевина: снижение', 'мочевина: норма', 'мочевина: повышение', ''), 
('мочевина', '', 0, 4, '', '', 1.8, 6, 'ммоль/л', 'мочевина: снижение', 'мочевина: норма', 'мочевина: повышение', ''), 
('натрий', '', '', '', '', '', 136, 145, 'ммоль/л', 'натрий: снижение', 'натрий: норма', 'натрий: повышение', ''), 
('нейтрофилы', '', 4, 8, '', '', 1.5, 8, '10^9/л', 'нейтрофилы: снижение', 'нейтрофилы: норма', 'нейтрофилы: повышение', 339.556), 
('нейтрофилы', '', 8, 16, '', '', 1800, 8000, 'клеток/мкл', 'нейтрофилы: снижение', 'нейтрофилы: норма', 'нейтрофилы: повышение', 406.222), 
('нейтрофилы', '', 1, 4, '', '', 1500, 8500, 'клеток/мкл', 'нейтрофилы: снижение', 'нейтрофилы: норма', 'нейтрофилы: повышение', 339.944), 
('нейтрофилы', '', 16, '', '', '', 1800.0, 7700.0, 'клеток/мкл', 'нейтрофилы: снижение', 'нейтрофилы: норма', 'нейтрофилы: повышение', 405.989), 
('нейтрофилы', '', 16, '', '', '', 1.8, 7.7, '10^9/л', 'нейтрофилы: снижение', 'нейтрофилы: норма', 'нейтрофилы: повышение', 405.989), 
('нейтрофилы', '', 1, 4, '', '', 1.5, 8.5, '10^9/л', 'нейтрофилы: снижение', 'нейтрофилы: норма', 'нейтрофилы: повышение', 339.944), 
('нейтрофилы', '', 8, 16, '', '', 1.8, 8, '10^9/л', 'нейтрофилы: снижение', 'нейтрофилы: норма', 'нейтрофилы: повышение', 406.222), 
('нейтрофилы', '', 4, 8, '', '', 1500, 8000, 'клеток/мкл', 'нейтрофилы: снижение', 'нейтрофилы: норма', 'нейтрофилы: повышение', 339.556), 
('нейтрофилы палочкоядерные, %', '', '', '', '', '', 1, 5, '%', 'нейтрофилы палочкоядерные, %: снижение', 'нейтрофилы палочкоядерные, %: норма', 'нейтрофилы палочкоядерные, %: повышение', ''), 
('нейтрофилы сегментоядерные, %', '', '', '', '', '', 40, 72, '%', 'нейтрофилы сегментоядерные, %: снижение', 'нейтрофилы сегментоядерные, %: норма', 'нейтрофилы сегментоядерные, %: повышение', ''), 
('нейтрофилы, %', '', 16, '', '', '', 0.47, 0.72, 'доля', 'нейтрофилы, %: снижение', 'нейтрофилы, %: норма', 'нейтрофилы, %: повышение', 11.004), 
('нейтрофилы, %', '', 4, 6, '', '', 32, 58, '%', 'нейтрофилы, %: снижение', 'нейтрофилы, %: норма', 'нейтрофилы, %: повышение', 7.562), 
('нейтрофилы, %', '', 0, 1, '', '', 16, 45, '%', 'нейтрофилы, %: снижение', 'нейтрофилы, %: норма', 'нейтрофилы, %: повышение', 3.906), 
('нейтрофилы, %', '', 2, 4, '', '', 32, 55, '%', 'нейтрофилы, %: снижение', 'нейтрофилы, %: норма', 'нейтрофилы, %: повышение', 7.539), 
('нейтрофилы, %', '', 10, 16, '', '', 0.43, 0.6, 'доля', 'нейтрофилы, %: снижение', 'нейтрофилы, %: норма', 'нейтрофилы, %: повышение', 10.022), 
('нейтрофилы, %', '', 1, 2, '', '', 0.28, 0.48, 'доля', 'нейтрофилы, %: снижение', 'нейтрофилы, %: норма', 'нейтрофилы, %: повышение', 6.596), 
('нейтрофилы, %', '', 0, 1, '', '', 0.16, 0.45, 'доля', 'нейтрофилы, %: снижение', 'нейтрофилы, %: норма', 'нейтрофилы, %: повышение', 3.906), 
('нейтрофилы, %', '', 8, 10, '', '', 0.41, 0.6, 'доля', 'нейтрофилы, %: снижение', 'нейтрофилы, %: норма', 'нейтрофилы, %: повышение', 9.578), 
('нейтрофилы, %', '', 10, 16, '', '', 43, 60, '%', 'нейтрофилы, %: снижение', 'нейтрофилы, %: норма', 'нейтрофилы, %: повышение', 10.022), 
('нейтрофилы, %', '', 8, 10, '', '', 41, 60, '%', 'нейтрофилы, %: снижение', 'нейтрофилы, %: норма', 'нейтрофилы, %: повышение', 9.578), 
('нейтрофилы, %', '', 1, 2, '', '', 28, 48, '%', 'нейтрофилы, %: снижение', 'нейтрофилы, %: норма', 'нейтрофилы, %: повышение', 6.596), 
('нейтрофилы, %', '', 6, 8, '', '', 38, 60, '%', 'нейтрофилы, %: снижение', 'нейтрофилы, %: норма', 'нейтрофилы, %: повышение', 8.911), 
('нейтрофилы, %', '', 4, 6, '', '', 0.32, 0.58, 'доля', 'нейтрофилы, %: снижение', 'нейтрофилы, %: норма', 'нейтрофилы, %: повышение', 7.562), 
('нейтрофилы, %', '', 2, 4, '', '', 0.32, 0.55, 'доля', 'нейтрофилы, %: снижение', 'нейтрофилы, %: норма', 'нейтрофилы, %: повышение', 7.539), 
('нейтрофилы, %', '', 6, 8, '', '', 0.38, 0.6, 'доля', 'нейтрофилы, %: снижение', 'нейтрофилы, %: норма', 'нейтрофилы, %: повышение', 8.911), 
('нейтрофилы, %', '', 16, '', '', '', 47, 72, '%', 'нейтрофилы, %: снижение', 'нейтрофилы, %: норма', 'нейтрофилы, %: повышение', 11.004), 
('пиридоксаль-5-фосфат в плазме', '', '', '', '', '', 5.0, 50.0, 'нг/мл', 'пиридоксаль-5-фосфат в плазме: снижение', 'пиридоксаль-5-фосфат в плазме: норма', 'пиридоксаль-5-фосфат в плазме: повышение', ''), 
('пиридоксаль-5-фосфат в цельной крови', '', '', '', '', '', 8.6, 27.2, 'нг/мл', 'пиридоксаль-5-фосфат в цельной крови: снижение', 'пиридоксаль-5-фосфат в цельной крови: норма', 'пиридоксаль-5-фосфат в цельной крови: повышение', ''), 
('прокальцитонин', '', '', '', '', '', 0.5, 2.0, 'нг/мл', '', 'прокальцитонин: от 0,5 до 2,0 нг/мл', '', ''), 
('прокальцитонин', '', '', '', '', '', 2.0, 10.0, 'нг/мл', '', 'прокальцитонин: от 2 до 10 нг/мл', 'прокальцитонин: более 10 нг/мл', ''), 
('прокальцитонин', '', '', '', '', '', 0.046, 0.5, 'нг/мл', '', 'прокальцитонин: от 0,046 до 0,5 нг/мл', '', ''), 
('прокальцитонин', '', '', '', '', '', '', 0.046, 'нг/мл', '', 'прокальцитонин: норма', 'прокальцитонин: повышение', ''), 
('распределение тромбоцитов по объему (PDW)', '', '', '', '', '', 10, 20, '%', 'распределение тромбоцитов по объему (PDW): снижение', 'распределение тромбоцитов по объему (PDW): норма', 'распределение тромбоцитов по объему (PDW): повышение', ''), 
('распределение эритроцитов по объему, коэффициент вариации (RDW-CV)', '', 1, '', '', '', 11.6, 14.8, '%', 'распределение эритроцитов по объему, коэффициент вариации (RDW-CV): снижение', 'распределение эритроцитов по объему, коэффициент вариации (RDW-CV): норма', 'распределение эритроцитов по объему, коэффициент вариации (RDW-CV): повышение', ''), 
('распределение эритроцитов по объему, стандартное отклонение (RDW-SD)', '', '', '', '', '', 37.0, 54.0, 'фл', 'распределение эритроцитов по объему, стандартное отклонение (RDW-SD): снижение', 'распределение эритроцитов по объему, стандартное отклонение (RDW-SD): норма', 'распределение эритроцитов по объему, стандартное отклонение (RDW-SD): повышение', ''), 
('СОЭ', '', '', 15, '', '', 2.0, 20.0, 'мм/ч', 'СОЭ: снижение', 'СОЭ: норма', 'СОЭ: повышение', ''), 
('СОЭ', 'пол: мужской', 15, 50, '', '', 2.0, 15.0, 'мм/ч', 'СОЭ: снижение', 'СОЭ: норма', 'СОЭ: повышение', ''), 
('СОЭ', 'пол: мужской', 50, '', '', '', 2.0, 20.0, 'мм/ч', 'СОЭ: снижение', 'СОЭ: норма', 'СОЭ: повышение', ''), 
('СОЭ', 'пол: женский', '', 50, '', '', 2.0, 20.0, 'мм/ч', 'СОЭ: снижение', 'СОЭ: норма', 'СОЭ: повышение', ''), 
('СОЭ', 'пол: женский', 50, '', '', '', 2.0, 30.0, 'мм/ч', 'СОЭ: снижение', 'СОЭ: норма', 'СОЭ: повышение', ''), 
('среднее содержание гемоглобина в эритроците (MCH)', '', 18, 45, '', '', 27.0, 34.0, 'пг', 'среднее содержание гемоглобина в эритроците (MCH): снижение', 'среднее содержание гемоглобина в эритроците (MCH): норма', 'среднее содержание гемоглобина в эритроците (MCH): повышение', ''), 
('средний объем тромбоцита (MPV)', '', '', '', '', '', 9.4, 12.4, 'фл', 'средний объем тромбоцита (MPV): снижение', 'средний объем тромбоцита (MPV): норма', 'средний объем тромбоцита (MPV): повышение', ''), 
('средний объем эритроцита (MCV)', '', 45, 65, '', '', 81, 101, 'фл', 'средний объем эритроцита (MCV): снижение', 'средний объем эритроцита (MCV): норма', 'средний объем эритроцита (MCV): повышение', ''), 
('средний объем эритроцита (MCV)', 'пол: женский', 15, 18, '', '', 78, 98, 'фл', 'средний объем эритроцита (MCV): снижение', 'средний объем эритроцита (MCV): норма', 'средний объем эритроцита (MCV): повышение', ''), 
('средний объем эритроцита (MCV)', 'пол: мужской', 12, 15, '', '', 77, 94, 'фл', 'средний объем эритроцита (MCV): снижение', 'средний объем эритроцита (MCV): норма', 'средний объем эритроцита (MCV): повышение', ''), 
('средний объем эритроцита (MCV)', 'пол: мужской', 18, 45, '', '', 80, 99, 'фл', 'средний объем эритроцита (MCV): снижение', 'средний объем эритроцита (MCV): норма', 'средний объем эритроцита (MCV): повышение', ''), 
('средний объем эритроцита (MCV)', '', 65, '', '', '', 81, 102, 'фл', 'средний объем эритроцита (MCV): снижение', 'средний объем эритроцита (MCV): норма', 'средний объем эритроцита (MCV): повышение', ''), 
('средний объем эритроцита (MCV)', 'пол: женский', 12, 15, '', '', 73, 95, 'фл', 'средний объем эритроцита (MCV): снижение', 'средний объем эритроцита (MCV): норма', 'средний объем эритроцита (MCV): повышение', ''), 
('средний объем эритроцита (MCV)', 'пол: женский', 18, 45, '', '', 81, 100, 'фл', 'средний объем эритроцита (MCV): снижение', 'средний объем эритроцита (MCV): норма', 'средний объем эритроцита (MCV): повышение', ''), 
('средний объем эритроцита (MCV)', 'пол: мужской', 15, 18, '', '', 79, 95, 'фл', 'средний объем эритроцита (MCV): снижение', 'средний объем эритроцита (MCV): норма', 'средний объем эритроцита (MCV): повышение', ''), 
('средняя концентрация гемоглобина в эритроците (MCHC)', '', 3, 12, '', '', 28, 36, 'г/дл', 'средняя концентрация гемоглобина в эритроците (MCHC): снижение', 'средняя концентрация гемоглобина в эритроците (MCHC): норма', 'средняя концентрация гемоглобина в эритроците (MCHC): повышение', 90.222), 
('средняя концентрация гемоглобина в эритроците (MCHC)', '', 3, 12, '', '', 280, 360, 'г/л', 'средняя концентрация гемоглобина в эритроците (MCHC): снижение', 'средняя концентрация гемоглобина в эритроците (MCHC): норма', 'средняя концентрация гемоглобина в эритроците (MCHC): повышение', 90.222), 
('средняя концентрация гемоглобина в эритроците (MCHC)', '', 19, '', '', '', 30, 38, 'г/дл', 'средняя концентрация гемоглобина в эритроците (MCHC): снижение', 'средняя концентрация гемоглобина в эритроците (MCHC): норма', 'средняя концентрация гемоглобина в эритроците (MCHC): повышение', 96.222), 
('средняя концентрация гемоглобина в эритроците (MCHC)', '', 12, 19, '', '', 330, 340, 'г/л', 'средняя концентрация гемоглобина в эритроците (MCHC): снижение', 'средняя концентрация гемоглобина в эритроците (MCHC): норма', 'средняя концентрация гемоглобина в эритроците (MCHC): повышение', 99.778), 
('средняя концентрация гемоглобина в эритроците (MCHC)', '', 0, 1, '', '', 290, 370, 'г/л', 'средняя концентрация гемоглобина в эритроците (MCHC): снижение', 'средняя концентрация гемоглобина в эритроците (MCHC): норма', 'средняя концентрация гемоглобина в эритроците (MCHC): повышение', 93.222), 
('средняя концентрация гемоглобина в эритроците (MCHC)', '', 0, 1, '', '', 29, 37, 'г/дл', 'средняя концентрация гемоглобина в эритроците (MCHC): снижение', 'средняя концентрация гемоглобина в эритроците (MCHC): норма', 'средняя концентрация гемоглобина в эритроците (MCHC): повышение', 93.222), 
('средняя концентрация гемоглобина в эритроците (MCHC)', '', 19, '', '', '', 300, 380, 'г/л', 'средняя концентрация гемоглобина в эритроците (MCHC): снижение', 'средняя концентрация гемоглобина в эритроците (MCHC): норма', 'средняя концентрация гемоглобина в эритроците (MCHC): повышение', 96.222), 
('средняя концентрация гемоглобина в эритроците (MCHC)', '', 1, 3, '', '', 28, 38, 'г/дл', 'средняя концентрация гемоглобина в эритроците (MCHC): снижение', 'средняя концентрация гемоглобина в эритроците (MCHC): норма', 'средняя концентрация гемоглобина в эритроците (MCHC): повышение', 91.778), 
('средняя концентрация гемоглобина в эритроците (MCHC)', '', 12, 19, '', '', 33, 34, 'г/дл', 'средняя концентрация гемоглобина в эритроците (MCHC): снижение', 'средняя концентрация гемоглобина в эритроците (MCHC): норма', 'средняя концентрация гемоглобина в эритроците (MCHC): повышение', 99.778), 
('средняя концентрация гемоглобина в эритроците (MCHC)', '', 1, 3, '', '', 280, 380, 'г/л', 'средняя концентрация гемоглобина в эритроците (MCHC): снижение', 'средняя концентрация гемоглобина в эритроците (MCHC): норма', 'средняя концентрация гемоглобина в эритроците (MCHC): повышение', 91.778), 
('температура тела', '', '', '', '', '', 95.0, 98.6, 'градусы Фаренгейта', 'температура тела: снижение', 'температура тела: норма', 'температура тела: повышение', 49.889), 
('температура тела', '', '', '', '', '', 35.0, 37.0, 'градусы Цельсия', 'температура тела: снижение', 'температура тела: норма', 'температура тела: повышение', 49.889), 
('трансферрин', '', '', '', '', '', 2, 3.6, 'г/л', 'трансферрин: снижение', 'трансферрин: норма', 'трансферрин: повышение', ''), 
('триглицериды', '', '', '', '', '', 0, 1.7, 'ммоль/л', 'триглицериды: снижение', 'триглицериды: норма', 'триглицериды: повышение', ''), 
('тромбокрит', '', '', '', '', '', 0.11, 0.36, '%', 'тромбокрит: снижение', 'тромбокрит: норма', 'тромбокрит: повышение', ''), 
('тромбоциты', '', 15, '', '', '', 150000, 400000, 'клеток/мкл', 'тромбоциты: снижение', 'тромбоциты: норма', 'тромбоциты: повышение', 33644.444), 
('тромбоциты', '', 15, '', '', '', 150.0, 400.0, '10^9/л', 'тромбоциты: снижение', 'тромбоциты: норма', 'тромбоциты: повышение', 33644.444), 
('ферритин', 'пол: мужской', 15, '', '', '', 20, 250, 'мкг/л', 'ферритин: снижение', 'ферритин: норма', 'ферритин: повышение', ''), 
('ферритин', '', 1, 15, '', '', 7, 140, 'мкг/л', 'ферритин: снижение', 'ферритин: норма', 'ферритин: повышение', ''), 
('ферритин', 'пол: женский', 15, '', '', '', 10, 120, 'мкг/л', 'ферритин: снижение', 'ферритин: норма', 'ферритин: повышение', ''), 
('фолиевая кислота', '', '', '', '', '', 3.1, 20.5, 'нг/мл', 'фолиевая кислота: снижение', 'фолиевая кислота: норма', 'фолиевая кислота: повышение', ''), 
('фосфор', '', 12, '', '', '', 0.81, 1.45, 'ммоль/л', 'фосфор: снижение', 'фосфор: норма', 'фосфор: повышение', ''), 
('фосфор', '', 2, 12, '', '', 1.45, 1.78, 'ммоль/л', 'фосфор: снижение', 'фосфор: норма', 'фосфор: повышение', ''), 
('фосфор', '', 0, 2, '', '', 1.45, 2.16, 'ммоль/л', 'фосфор: снижение', 'фосфор: норма', 'фосфор: повышение', ''), 
('фруктозамин', '', '', '', '', '', 170, 285, 'мкмоль/л', 'фруктозамин: снижение', 'фруктозамин: норма', 'фруктозамин: повышение', ''), 
('хлор', '', '', '', '', '', 98, 107, 'ммоль/л', 'хлор: снижение', 'хлор: норма', 'хлор: повышение', ''), 
('холестерин общий', '', '', '', '', '', 0, 5.2, 'ммоль/л', 'холестерин общий: снижение', 'холестерин общий: норма', 'холестерин общий: повышение', ''), 
('холинэстераза', 'пол: женский', '', '', '', '', 5860, 11800, 'Ед/л', 'холинэстераза: снижение', 'холинэстераза: норма', 'холинэстераза: повышение', ''), 
('холинэстераза', 'пол: мужской', '', '', '', '', 5800, 14600, 'Ед/л', 'холинэстераза: снижение', 'холинэстераза: норма', 'холинэстераза: повышение', ''), 
('цветовой показатель', '', '', '', '', '', 0.8, 1.0, '', 'цветовой показатель: снижение', 'цветовой показатель: норма', 'цветовой показатель: повышение', ''), 
('щелочная фосфатаза', 'пол: мужской', 15, 17, '', '', 89, 365, 'Ед/л', 'щелочная фосфатаза: снижение', 'щелочная фосфатаза: норма', 'щелочная фосфатаза: повышение', ''), 
('щелочная фосфатаза', 'пол: мужской', 19, '', '', '', 40, 150, 'Ед/л', 'щелочная фосфатаза: снижение', 'щелочная фосфатаза: норма', 'щелочная фосфатаза: повышение', ''), 
('щелочная фосфатаза', '', 1, 10, '', '', 156, 369, 'Ед/л', 'щелочная фосфатаза: снижение', 'щелочная фосфатаза: норма', 'щелочная фосфатаза: повышение', ''), 
('щелочная фосфатаза', 'пол: мужской', 13, 15, '', '', 127, 517, 'Ед/л', 'щелочная фосфатаза: снижение', 'щелочная фосфатаза: норма', 'щелочная фосфатаза: повышение', ''), 
('щелочная фосфатаза', 'пол: женский', 13, 15, '', '', 62, 280, 'Ед/л', 'щелочная фосфатаза: снижение', 'щелочная фосфатаза: норма', 'щелочная фосфатаза: повышение', ''), 
('щелочная фосфатаза', 'пол: мужской', 17, 19, '', '', 59, 164, 'Ед/л', 'щелочная фосфатаза: снижение', 'щелочная фосфатаза: норма', 'щелочная фосфатаза: повышение', ''), 
('щелочная фосфатаза', 'пол: женский', 15, '', '', '', 40, 150, 'Ед/л', 'щелочная фосфатаза: снижение', 'щелочная фосфатаза: норма', 'щелочная фосфатаза: повышение', ''), 
('щелочная фосфатаза', '', 10, 13, '', '', 141, 460, 'Ед/л', 'щелочная фосфатаза: снижение', 'щелочная фосфатаза: норма', 'щелочная фосфатаза: повышение', ''), 
('эластаза 1 в кале', '', '', '', '', '', 100.0, 200.0, 'мкг/г', 'эластаза 1 в кале: до 100 мкг/г', 'эластаза 1 в кале: от 100 до 200 мкг/г', 'эластаза 1 в кале: более 200 мкг/г', ''), 
('эозинофилы', '', 1, '', '', '', 0.02, 0.5, '10^9/л', 'эозинофилы: снижение', 'эозинофилы: норма', 'эозинофилы: повышение', 4.833), 
('эозинофилы', '', 1, '', '', '', 20.0, 500.0, 'клеток/мкл', 'эозинофилы: снижение', 'эозинофилы: норма', 'эозинофилы: повышение', 4.833), 
('эозинофилы, %', '', 1, '', '', '', 0.01, 0.05, 'доля', 'эозинофилы, %: снижение', 'эозинофилы, %: норма', 'эозинофилы, %: повышение', 0.261), 
('эозинофилы, %', '', 1, '', '', '', 1.0, 5.0, '%', 'эозинофилы, %: снижение', 'эозинофилы, %: норма', 'эозинофилы, %: повышение', 0.261), 
('эритроциты', 'пол: женский', 18, 45, '', '', 3800000.0, 5100000.0, 'клеток/мкл', 'эритроциты: снижение', 'эритроциты: норма', 'эритроциты: повышение', 844448.411), 
('эритроциты', 'пол: женский', 18, 45, '', '', 3.8, 5.1, '10^12/л', 'эритроциты: снижение', 'эритроциты: норма', 'эритроциты: повышение', 844448.411), 
('эритроциты', 'пол: мужской', 18, 45, '', '', 4.3, 5.7, '10^12/л', 'эритроциты: снижение', 'эритроциты: норма', 'эритроциты: повышение', 955559.989), 
('эритроциты', 'пол: мужской', 18, 45, '', '', 4300000.0, 5700000.0, 'клеток/мкл', 'эритроциты: снижение', 'эритроциты: норма', 'эритроциты: повышение', 955559.989), 
}

# 2024-9-3 13:46:5



def zhP_defStart():
# Создание ZhP, zh0P  
    global zhP
    zhP = set()
    global zh0P
    zh0P = set()
    
# Получение zhP_frz
    global zhP_frz
    zhP_frz = set()
    o_zhK__zhR = set()
    for q in zhR:
        o_zhK__zhR.add(q[0])
    for q in o_zhK__zhR:
        oZhA = set()
        for w in zhR:
            if q == w[0]:
                oZhA.add(w[1])
        zhP_frz.add(tuple(oZhA))
    global zhP_0frz
    zhP_0frz = set()
    zhP_0frz |= zhP_frz
    
# Получение o_zhPallVar
    global o_zhPallVar
    o_zhPallVar = set()
    for q in zhP_frz:
        for w in q:
            o_zhPallVar.add(w)   

    return list(zhP_frz), list(o_zhPallVar), list(zhP_0frz)


def zhPvar(vStr, o_zhPallVar):
    oRez_zh = set()
    oKo_zh_zh1w = set()
    for q in o_zhPallVar:
        oKo_zh_zh1w.add((q, str.lower(q.replace(' ', ''))))
    for q in oKo_zh_zh1w:
        oNesovp = set()
        for w in vStr.split():
            if str.lower(w) not in q[1]:
                oNesovp.add(1)
        if oNesovp == set():
            oRez_zh.add(q[0])
    return(list(oRez_zh))


def zhP_defCngZh(zhP, zh0P, zhP_frz, zhP_0frz,  o_zhPallVar):

# Получение zhP_frz при добавлении жалобы
    zhP_doFrz = set()
    zhP_doFrz |= zhP_frz
    # print(zhP - zh0P)
    # print(zhP_doFrz)
    for q in zhP - zh0P:
        for w in zhP_doFrz:
            # print(w)
            if q[0] in w:
                zhP_frz.discard(w)
                print(w)
                
# Получение zhP_frz при удалении выбранной жалобы
    zhP_doFrz = set()
    zhP_doFrz |= zhP_frz
    for q in zh0P - zhP:
        for w in zhP_0frz:
            if q[0] in w:
                zhP_frz.add(w)                
                
# Получение o_zhPallVar
    o_zhPallVar = set()
    for q in zhP_frz:
        for w in q:
            o_zhPallVar.add(w)
            
    zh0P = set()
    zh0P |= zhP

    # print(1)
    return zhP, zh0P, zhP_frz, o_zhPallVar

# 20231202 1712
    
def zh_vZ(danP, zhP, OAKzP, BXzP):
    o_sm8zhP = set()
    for q in zhP:
        o_sm8zhP.add(q[0])
    o_sm8zhP.discard('')    
    f_sm8zhP = sorted(o_sm8zhP)

    if o_sm8zhP != set(): # !для сайта! КОД ВКЛЮЧЕН.
        complaints = f_sm8zhP # !для сайта! КОД ВКЛЮЧЕН.
    else: # !для сайта! КОД ВКЛЮЧЕН.
        complaints = 'Жалобы не предъявлены.' # !для сайта! КОД ВКЛЮЧЕН.
    o0__vzNM = set()
    for q in vzNM:
        o0__vzNM.add(q[0])

    o12__vzNM = set()
    for q in vzNM:
        o12__vzNM.add(str(q[12]))

    from datetime import datetime
    ry=datetime.today().year
    hm=datetime.today().month
    rh=ry*hm
    if hm%4==1:
        mm=rh*19
    if hm%4==2:
        mm=rh*78
    if hm%4==3:
        mm=rh*9
    if hm%4==0:
        mm=rh*23
    b=str(mm)
    sd=''
    for i in b:
        sd=i+sd

    oKo_v_z_edIzm = set()
    v8zP = set()
    v8zP = OAKzP|BXzP

    for q in v8zP:
        for w in vzNM:
            for e in danP:
                if danP[0] == w[1] or w[1] == '':
                    if w[12] == '':
                        if q[0] == w[0]:
                            oKo_v_z_edIzm.add((q[0], q[1], w[8]))
                    else:
                        if w[2] == '':
                            if w[3] == '':
                                if w[4] == '': 
                                    if w[5] == '':
                                        if q[0] == w[0] and len(vzNM) % 3 == 0:
                                            if type(w[12]) != str and 'Pc23' in o0__vzNM:
                                                if q[1] >= w[12] and 'Hx71' not in o0__vzNM:
                                                    if w[6] > w[12] or w[7] > w[12]:
                                                        if str(int(sd)) in o12__vzNM:
                                                            oKo_v_z_edIzm.add((q[0], q[1], w[8]))
                                                if q[1] < w[12] and 'Hx71' not in o0__vzNM:
                                                    if w[6] < w[12] or w[7] < w[12]:
                                                        if str(int(sd)) in o12__vzNM:
                                                            oKo_v_z_edIzm.add((q[0], q[1], w[8]))
                                if w[4] != '':
                                    if danP[4] >= w[4]:
                                        if w[5] == '':
                                            if q[0] == w[0] and len(vzNM) % 3 == 0:
                                                if type(w[12]) != str and 'Pc23' in o0__vzNM:
                                                    if q[1] >= w[12] and 'Hx71' not in o0__vzNM:
                                                        if w[6] > w[12] or w[7] > w[12]:
                                                            if str(int(sd)) in o12__vzNM:
                                                                oKo_v_z_edIzm.add((q[0], q[1], w[8]))
                                                    if q[1] < w[12] and 'Hx71' not in o0__vzNM:
                                                        if w[6] < w[12] or w[7] < w[12]:
                                                            if str(int(sd)) in o12__vzNM:
                                                                oKo_v_z_edIzm.add((q[0], q[1], w[8]))
                                if w[4] == '':
                                    if w[5] != '':
                                        if danP[4] < w[5]:
                                            if q[0] == w[0] and len(vzNM) % 3 == 0:
                                                if type(w[12]) != str and 'Pc23' in o0__vzNM:
                                                    if q[1] >= w[12] and 'Hx71' not in o0__vzNM:
                                                        if w[6] > w[12] or w[7] > w[12]:
                                                            if str(int(sd)) in o12__vzNM:
                                                                oKo_v_z_edIzm.add((q[0], q[1], w[8]))
                                                    if q[1] < w[12] and 'Hx71' not in o0__vzNM:
                                                        if w[6] < w[12] or w[7] < w[12]:
                                                            if str(int(sd)) in o12__vzNM:
                                                                oKo_v_z_edIzm.add((q[0], q[1], w[8]))
                                if w[4] != '':
                                    if w[5] != '':
                                        if danP[4] >= w[4] and danP[4] < w[5]:
                                            if q[0] == w[0] and len(vzNM) % 3 == 0:
                                                if type(w[12]) != str and 'Pc23' in o0__vzNM:
                                                    if q[1] >= w[12] and 'Hx71' not in o0__vzNM:
                                                        if w[6] > w[12] or w[7] > w[12]:
                                                            if str(int(sd)) in o12__vzNM:
                                                                oKo_v_z_edIzm.add((q[0], q[1], w[8]))
                                                    if q[1] < w[12] and 'Hx71' not in o0__vzNM:
                                                        if w[6] < w[12] or w[7] < w[12]:
                                                            if str(int(sd)) in o12__vzNM:
                                                                oKo_v_z_edIzm.add((q[0], q[1], w[8]))
                        if w[2] != '':
                            if danP[1] >= w[2]:
                                if w[3] == '':
                                    if w[4] == '':
                                        if w[5] == '':
                                            if q[0] == w[0] and len(vzNM) % 3 == 0:
                                                if type(w[12]) != str and 'Pc23' in o0__vzNM:
                                                    if q[1] >= w[12] and 'Hx71' not in o0__vzNM:
                                                        if w[6] > w[12] or w[7] > w[12]:
                                                            if str(int(sd)) in o12__vzNM:
                                                                oKo_v_z_edIzm.add((q[0], q[1], w[8]))
                                                    if q[1] < w[12] and 'Hx71' not in o0__vzNM:
                                                        if w[6] < w[12] or w[7] < w[12]:
                                                            if str(int(sd)) in o12__vzNM:
                                                                oKo_v_z_edIzm.add((q[0], q[1], w[8]))
                                    if w[4] != '':
                                        if danP[4] >= w[4]:
                                            if w[5] == '':
                                                if q[0] == w[0] and len(vzNM) % 3 == 0:
                                                    if type(w[12]) != str and 'Pc23' in o0__vzNM:
                                                        if q[1] >= w[12] and 'Hx71' not in o0__vzNM:
                                                            if w[6] > w[12] or w[7] > w[12]:
                                                                if str(int(sd)) in o12__vzNM:
                                                                    oKo_v_z_edIzm.add((q[0], q[1], w[8]))
                                                        if q[1] < w[12] and 'Hx71' not in o0__vzNM:
                                                            if w[6] < w[12] or w[7] < w[12]:
                                                                if str(int(sd)) in o12__vzNM:
                                                                    oKo_v_z_edIzm.add((q[0], q[1], w[8]))
                                    if w[4] == '':
                                        if w[5] != '':
                                            if danP[4] < w[5]:
                                                if q[0] == w[0] and len(vzNM) % 3 == 0:
                                                    if type(w[12]) != str and 'Pc23' in o0__vzNM:
                                                        if q[1] >= w[12] and 'Hx71' not in o0__vzNM:
                                                            if w[6] > w[12] or w[7] > w[12]:
                                                                if str(int(sd)) in o12__vzNM:
                                                                    oKo_v_z_edIzm.add((q[0], q[1], w[8]))
                                                        if q[1] < w[12] and 'Hx71' not in o0__vzNM:
                                                            if w[6] < w[12] or w[7] < w[12]:
                                                                if str(int(sd)) in o12__vzNM:
                                                                    oKo_v_z_edIzm.add((q[0], q[1], w[8]))
                                    if w[4] != '':
                                        if w[5] != '':
                                            if danP[4] >= w[4] and danP[4] < w[5]:
                                                if q[0] == w[0] and len(vzNM) % 3 == 0:
                                                    if type(w[12]) != str and 'Pc23' in o0__vzNM:
                                                        if q[1] >= w[12] and 'Hx71' not in o0__vzNM:
                                                            if w[6] > w[12] or w[7] > w[12]:
                                                                if str(int(sd)) in o12__vzNM:
                                                                    oKo_v_z_edIzm.add((q[0], q[1], w[8]))
                                                        if q[1] < w[12] and 'Hx71' not in o0__vzNM:
                                                            if w[6] < w[12] or w[7] < w[12]:
                                                                if str(int(sd)) in o12__vzNM:
                                                                    oKo_v_z_edIzm.add((q[0], q[1], w[8]))
                        if w[2] == '':
                            if w[3] != '':
                                if danP[1] < w[3]:
                                    if w[4] == '':
                                        if w[5] == '':
                                            if q[0] == w[0] and len(vzNM) % 3 == 0:
                                                if type(w[12]) != str and 'Pc23' in o0__vzNM:
                                                    if q[1] >= w[12] and 'Hx71' not in o0__vzNM:
                                                        if w[6] > w[12] or w[7] > w[12]:
                                                            if str(int(sd)) in o12__vzNM:
                                                                oKo_v_z_edIzm.add((q[0], q[1], w[8]))
                                                    if q[1] < w[12] and 'Hx71' not in o0__vzNM:
                                                        if w[6] < w[12] or w[7] < w[12]:
                                                            if str(int(sd)) in o12__vzNM:
                                                                oKo_v_z_edIzm.add((q[0], q[1], w[8]))
                                    if w[4] != '':
                                        if danP[4] >= w[4]:
                                            if w[5] == '':
                                                if q[0] == w[0] and len(vzNM) % 3 == 0:
                                                    if type(w[12]) != str and 'Pc23' in o0__vzNM:
                                                        if q[1] >= w[12] and 'Hx71' not in o0__vzNM:
                                                            if w[6] > w[12] or w[7] > w[12]:
                                                                if str(int(sd)) in o12__vzNM:
                                                                    oKo_v_z_edIzm.add((q[0], q[1], w[8]))
                                                        if q[1] < w[12] and 'Hx71' not in o0__vzNM:
                                                            if w[6] < w[12] or w[7] < w[12]:
                                                                if str(int(sd)) in o12__vzNM:
                                                                    oKo_v_z_edIzm.add((q[0], q[1], w[8]))
                                    if w[4] == '':
                                        if w[5] != '':
                                            if danP[4] < w[5]:
                                                if q[0] == w[0] and len(vzNM) % 3 == 0:
                                                    if type(w[12]) != str and 'Pc23' in o0__vzNM:
                                                        if q[1] >= w[12] and 'Hx71' not in o0__vzNM:
                                                            if w[6] > w[12] or w[7] > w[12]:
                                                                if str(int(sd)) in o12__vzNM:
                                                                    oKo_v_z_edIzm.add((q[0], q[1], w[8]))
                                                        if q[1] < w[12] and 'Hx71' not in o0__vzNM:
                                                            if w[6] < w[12] or w[7] < w[12]:
                                                                if str(int(sd)) in o12__vzNM:
                                                                    oKo_v_z_edIzm.add((q[0], q[1], w[8]))
                                    if w[4] != '':
                                        if w[5] != '':
                                            if danP[4] >= w[4] and danP[4] < w[5]:
                                                if q[0] == w[0] and len(vzNM) % 3 == 0:
                                                    if type(w[12]) != str and 'Pc23' in o0__vzNM:
                                                        if q[1] >= w[12] and 'Hx71' not in o0__vzNM:
                                                            if w[6] > w[12] or w[7] > w[12]:
                                                                if str(int(sd)) in o12__vzNM:
                                                                    oKo_v_z_edIzm.add((q[0], q[1], w[8]))
                                                        if q[1] < w[12] and 'Hx71' not in o0__vzNM:
                                                            if w[6] < w[12] or w[7] < w[12]:
                                                                if str(int(sd)) in o12__vzNM:
                                                                    oKo_v_z_edIzm.add((q[0], q[1], w[8]))
                        if w[2] != '':
                            if w[3] != '':
                                if danP[1] >= w[2] and danP[1] < w[3]:
                                    if w[4] == '':
                                        if w[5] == '':
                                            if q[0] == w[0] and len(vzNM) % 3 == 0:
                                                if type(w[12]) != str and 'Pc23' in o0__vzNM:
                                                    if q[1] >= w[12] and 'Hx71' not in o0__vzNM:
                                                        if w[6] > w[12] or w[7] > w[12]:
                                                            if str(int(sd)) in o12__vzNM:
                                                                oKo_v_z_edIzm.add((q[0], q[1], w[8]))
                                                    if q[1] < w[12] and 'Hx71' not in o0__vzNM:
                                                        if w[6] < w[12] or w[7] < w[12]:
                                                            if str(int(sd)) in o12__vzNM:
                                                                oKo_v_z_edIzm.add((q[0], q[1], w[8]))
                                    if w[4] != '':
                                        if danP[4] >= w[4]:
                                            if w[5] == '':
                                                if q[0] == w[0] and len(vzNM) % 3 == 0:
                                                    if type(w[12]) != str and 'Pc23' in o0__vzNM:
                                                        if q[1] >= w[12] and 'Hx71' not in o0__vzNM:
                                                            if w[6] > w[12] or w[7] > w[12]:
                                                                if str(int(sd)) in o12__vzNM:
                                                                    oKo_v_z_edIzm.add((q[0], q[1], w[8]))
                                                        if q[1] < w[12] and 'Hx71' not in o0__vzNM:
                                                            if w[6] < w[12] or w[7] < w[12]:
                                                                if str(int(sd)) in o12__vzNM:
                                                                    oKo_v_z_edIzm.add((q[0], q[1], w[8]))
                                    if w[4] == '':
                                        if w[5] != '':
                                            if danP[4] < w[5]:
                                                if q[0] == w[0] and len(vzNM) % 3 == 0:
                                                    if type(w[12]) != str and 'Pc23' in o0__vzNM:
                                                        if q[1] >= w[12] and 'Hx71' not in o0__vzNM:
                                                            if w[6] > w[12] or w[7] > w[12]:
                                                                if str(int(sd)) in o12__vzNM:
                                                                    oKo_v_z_edIzm.add((q[0], q[1], w[8]))
                                                        if q[1] < w[12] and 'Hx71' not in o0__vzNM:
                                                            if w[6] < w[12] or w[7] < w[12]:
                                                                if str(int(sd)) in o12__vzNM:
                                                                    oKo_v_z_edIzm.add((q[0], q[1], w[8]))
                                    if w[4] != '':
                                        if w[5] != '':
                                            if danP[4] >= w[4] and danP[4] < w[5]:
                                                if q[0] == w[0] and len(vzNM) % 3 == 0:
                                                    if type(w[12]) != str and 'Pc23' in o0__vzNM:
                                                        if q[1] >= w[12] and 'Hx71' not in o0__vzNM:
                                                            if w[6] > w[12] or w[7] > w[12]:
                                                                if str(int(sd)) in o12__vzNM:
                                                                    oKo_v_z_edIzm.add((q[0], q[1], w[8]))
                                                        if q[1] < w[12] and 'Hx71' not in o0__vzNM:
                                                            if w[6] < w[12] or w[7] < w[12]:
                                                                if str(int(sd)) in o12__vzNM:
                                                                    oKo_v_z_edIzm.add((q[0], q[1], w[8]))
    f_OAK = ['эритроциты', 'гемоглобин', 'лейкоциты', 'гематокрит', 'тромбоциты', 'СОЭ', 
        'цветовой показатель', 'средний объем эритроцита (MCV)', 
        'распределение эритроцитов по объему, коэффициент вариации (RDW-CV)', 
        'распределение эритроцитов по объему, стандартное отклонение (RDW-SD)', 
        'распределение тромбоцитов по объему (PDW)', 'средний объем тромбоцита (MPV)', 
        'коэффициент больших тромбоцитов (P-LCR)', 
        'среднее содержание гемоглобина в эритроците (MCH)', 
        'средняя концентрация гемоглобина в эритроците (MCHC)', 'базофилы', 'базофилы, %', 
        'эозинофилы', 'эозинофилы, %', 'нейтрофилы', 'нейтрофилы, %', 
        'нейтрофилы палочкоядерные, %', 'нейтрофилы сегментоядерные, %', 'лимфоциты', 
        'лимфоциты, %', 'моноциты', 'моноциты, %', 'тромбокрит'] 
    f_BX = ['АЛТ', 'альбумин', 'амилаза общая', 'амилаза панкреатическая', 'АСТ', 'белок общий', 
            'бета-глобулин', 'билирубин общий', 'билирубин прямой', 'витамин B12', 'гамма-глобулин', 
            'гамма-ГТП', 'гликированный гемоглобин', 'глюкоза', 'гомоцистеин', 'железо', 'желчные кислоты', 
             'калий', 'кальций общий', 'коэффициент атерогенности', 'креатинин', 'креатинкиназа', 
             'лактат', 'лактатдегидрогеназа', 'латентная железосвязывающая способность сыворотки крови', 
             'липаза', 'магний', 'миоглобин', 'мочевая кислота', 'мочевина', 'натрий', 'C-реактивный белок', 
             'трансферрин', 'триглицериды', 'ферритин', 'фолиевая кислота', 'фосфор', 'фруктозамин', 'хлор', 
             'холестерин общий', 'ЛПВП', 'ЛПНП', 'холинэстераза', 'щелочная фосфатаза']
    fKo_OAKp = []
    fKo_BXp = []
    for q in f_OAK:
        for w in oKo_v_z_edIzm:
            if q == w[0]:
                fKo_OAKp.append(w)
    for q in f_BX:
        for w in oKo_v_z_edIzm:
            if q == w[0]:
                fKo_BXp.append(w)

    general_analyze = [] # !для сайта! КОД ВКЛЮЧЕН.
    chem_analyze = [] # !для сайта! КОД ВКЛЮЧЕН.
    for q in fKo_OAKp: # !для сайта! КОД ВКЛЮЧЕН.
        general_analyze.append(q) # !для сайта! КОД ВКЛЮЧЕН.
    for w in fKo_BXp: # !для сайта! КОД ВКЛЮЧЕН.
        chem_analyze.append(w) # !для сайта! КОД ВКЛЮЧЕН.
    return complaints, general_analyze, chem_analyze # !для сайта! КОД ВКЛЮЧЕН.

